robertlipe/svdtoheaders/demo/h/ch32v103_reg.h

/* PWR - Power control */
#define CH32V103_PWR_BASE                 0x40007000
#define CH32V103_PWR_CTLR_OFFSET          0x0000
#define CH32V103_PWR_CTLR                 (CH32V103_PWR_BASE + CH32V103_PWR_CTLR_OFFSET)
#define CH32V103_PWR_CTLR_LPDS            (1 <<  0) /* 00000001: Low Power Deep Sleep */
#define CH32V103_PWR_CTLR_PDDS            (1 <<  1) /* 00000002: Power Down Deep Sleep */
#define CH32V103_PWR_CTLR_CWUF            (1 <<  2) /* 00000004: Clear Wake-up Flag */
#define CH32V103_PWR_CTLR_CSBF            (1 <<  3) /* 00000008: Clear STANDBY Flag */
#define CH32V103_PWR_CTLR_PVDE            (1 <<  4) /* 00000010: Power Voltage Detector Enable */
#define CH32V103_PWR_CTLR_PLS             (0x7 << 5) /* 000000e0: PVD Level Selection */
#define CH32V103_PWR_CTLR_PLS_MASK        (0x7 << 5)
#define CH32V103_PWR_CTLR_DBP             (1 <<  8) /* 00000100: Disable Backup Domain write protection */
#define CH32V103_PWR_CSR_OFFSET           0x0004
#define CH32V103_PWR_CSR                  (CH32V103_PWR_BASE + CH32V103_PWR_CSR_OFFSET)
#define CH32V103_PWR_CSR_WUF              (1 <<  0) /* 00000001: Wake-Up Flag */
#define CH32V103_PWR_CSR_SBF              (1 <<  1) /* 00000002: STANDBY Flag */
#define CH32V103_PWR_CSR_PVDO             (1 <<  2) /* 00000004: PVD Output */
#define CH32V103_PWR_CSR_EWUP             (1 <<  8) /* 00000100: Enable WKUP pin */

/* RCC - Reset and clock control */
#define CH32V103_RCC_BASE                 0x40021000
#define CH32V103_RCC_CTLR_OFFSET          0x0000
#define CH32V103_RCC_CTLR                 (CH32V103_RCC_BASE + CH32V103_RCC_CTLR_OFFSET)
#define CH32V103_RCC_CTLR_HSION           (1 <<  0) /* 00000001: Internal High Speed clock enable */
#define CH32V103_RCC_CTLR_HSIRDY          (1 <<  1) /* 00000002: Internal High Speed clock ready flag */
#define CH32V103_RCC_CTLR_HSITRIM         (0x1f << 3) /* 000000f8: Internal High Speed clock trimming */
#define CH32V103_RCC_CTLR_HSITRIM_MASK    (0x1f << 3)
#define CH32V103_RCC_CTLR_HSICAL          (0xff << 8) /* 0000ff00: Internal High Speed clock Calibration */
#define CH32V103_RCC_CTLR_HSICAL_MASK     (0xff << 8)
#define CH32V103_RCC_CTLR_HSEON           (1 << 16) /* 00010000: External High Speed clock enable */
#define CH32V103_RCC_CTLR_HSERDY          (1 << 17) /* 00020000: External High Speed clock ready flag */
#define CH32V103_RCC_CTLR_HSEBYP          (1 << 18) /* 00040000: External High Speed clock Bypass */
#define CH32V103_RCC_CTLR_CSSON           (1 << 19) /* 00080000: Clock Security System enable */
#define CH32V103_RCC_CTLR_PLLON           (1 << 24) /* 01000000: PLL enable */
#define CH32V103_RCC_CTLR_PLLRDY          (1 << 25) /* 02000000: PLL clock ready flag */
#define CH32V103_RCC_CFGR0_OFFSET         0x0004
#define CH32V103_RCC_CFGR0                (CH32V103_RCC_BASE + CH32V103_RCC_CFGR0_OFFSET)
#define CH32V103_RCC_CFGR0_SW             (0x3 << 0) /* 00000003: System clock Switch */
#define CH32V103_RCC_CFGR0_SW_MASK        (0x3 << 0)
#define CH32V103_RCC_CFGR0_SWS            (0x3 << 2) /* 0000000c: System Clock Switch Status */
#define CH32V103_RCC_CFGR0_SWS_MASK       (0x3 << 2)
#define CH32V103_RCC_CFGR0_HPRE           (0xf << 4) /* 000000f0: AHB prescaler */
#define CH32V103_RCC_CFGR0_HPRE_MASK      (0xf << 4)
#define CH32V103_RCC_CFGR0_PPRE1          (0x7 << 8) /* 00000700: APB Low speed prescaler(APB1) */
#define CH32V103_RCC_CFGR0_PPRE1_MASK     (0x7 << 8)
#define CH32V103_RCC_CFGR0_PPRE2          (0x7 << 11) /* 00003800: APB High speed prescaler(APB2) */
#define CH32V103_RCC_CFGR0_PPRE2_MASK     (0x7 << 11)
#define CH32V103_RCC_CFGR0_ADCPRE         (0x3 << 14) /* 0000c000: ADC prescaler */
#define CH32V103_RCC_CFGR0_ADCPRE_MASK    (0x3 << 14)
#define CH32V103_RCC_CFGR0_PLLSRC         (1 << 16) /* 00010000: PLL entry clock source */
#define CH32V103_RCC_CFGR0_PLLXTPRE       (1 << 17) /* 00020000: HSE divider for PLL entry */
#define CH32V103_RCC_CFGR0_PLLMUL         (0xf << 18) /* 003c0000: PLL Multiplication Factor */
#define CH32V103_RCC_CFGR0_PLLMUL_MASK    (0xf << 18)
#define CH32V103_RCC_CFGR0_USBPRE         (1 << 22) /* 00400000: USB prescaler */
#define CH32V103_RCC_CFGR0_MCO            (0x7 << 24) /* 07000000: Microcontroller clock output */
#define CH32V103_RCC_CFGR0_MCO_MASK       (0x7 << 24)
#define CH32V103_RCC_INTR_OFFSET          0x0008
#define CH32V103_RCC_INTR                 (CH32V103_RCC_BASE + CH32V103_RCC_INTR_OFFSET)
#define CH32V103_RCC_INTR_LSIRDYF         (1 <<  0) /* 00000001: LSI Ready Interrupt flag */
#define CH32V103_RCC_INTR_LSERDYF         (1 <<  1) /* 00000002: LSE Ready Interrupt flag */
#define CH32V103_RCC_INTR_HSIRDYF         (1 <<  2) /* 00000004: HSI Ready Interrupt flag */
#define CH32V103_RCC_INTR_HSERDYF         (1 <<  3) /* 00000008: HSE Ready Interrupt flag */
#define CH32V103_RCC_INTR_PLLRDYF         (1 <<  4) /* 00000010: PLL Ready Interrupt flag */
#define CH32V103_RCC_INTR_CSSF            (1 <<  7) /* 00000080: Clock Security System Interrupt flag */
#define CH32V103_RCC_INTR_LSIRDYIE        (1 <<  8) /* 00000100: LSI Ready Interrupt Enable */
#define CH32V103_RCC_INTR_LSERDYIE        (1 <<  9) /* 00000200: LSE Ready Interrupt Enable */
#define CH32V103_RCC_INTR_HSIRDYIE        (1 << 10) /* 00000400: HSI Ready Interrupt Enable */
#define CH32V103_RCC_INTR_HSERDYIE        (1 << 11) /* 00000800: HSE Ready Interrupt Enable */
#define CH32V103_RCC_INTR_PLLRDYIE        (1 << 12) /* 00001000: PLL Ready Interrupt Enable */
#define CH32V103_RCC_INTR_LSIRDYC         (1 << 16) /* 00010000: LSI Ready Interrupt Clear */
#define CH32V103_RCC_INTR_LSERDYC         (1 << 17) /* 00020000: LSE Ready Interrupt Clear */
#define CH32V103_RCC_INTR_HSIRDYC         (1 << 18) /* 00040000: HSI Ready Interrupt Clear */
#define CH32V103_RCC_INTR_HSERDYC         (1 << 19) /* 00080000: HSE Ready Interrupt Clear */
#define CH32V103_RCC_INTR_PLLRDYC         (1 << 20) /* 00100000: PLL Ready Interrupt Clear */
#define CH32V103_RCC_INTR_CSSC            (1 << 23) /* 00800000: Clock security system interrupt clear */
#define CH32V103_RCC_APB2PRSTR_OFFSET     0x000c
#define CH32V103_RCC_APB2PRSTR            (CH32V103_RCC_BASE + CH32V103_RCC_APB2PRSTR_OFFSET)
#define CH32V103_RCC_APB2PRSTR_AFIORST    (1 <<  0) /* 00000001: Alternate function I/O reset */
#define CH32V103_RCC_APB2PRSTR_IOPARST    (1 <<  2) /* 00000004: IO port A reset */
#define CH32V103_RCC_APB2PRSTR_IOPBRST    (1 <<  3) /* 00000008: IO port B reset */
#define CH32V103_RCC_APB2PRSTR_IOPCRST    (1 <<  4) /* 00000010: IO port C reset */
#define CH32V103_RCC_APB2PRSTR_IOPDRST    (1 <<  5) /* 00000020: IO port D reset */
#define CH32V103_RCC_APB2PRSTR_ADCRST     (1 <<  9) /* 00000200: ADC interface reset */
#define CH32V103_RCC_APB2PRSTR_TIM1RST    (1 << 11) /* 00000800: TIM1 timer reset */
#define CH32V103_RCC_APB2PRSTR_SPI1RST    (1 << 12) /* 00001000: SPI 1 reset */
#define CH32V103_RCC_APB2PRSTR_USART1RST  (1 << 14) /* 00004000: USART1 reset */
#define CH32V103_RCC_APB1PRSTR_OFFSET     0x0010
#define CH32V103_RCC_APB1PRSTR            (CH32V103_RCC_BASE + CH32V103_RCC_APB1PRSTR_OFFSET)
#define CH32V103_RCC_APB1PRSTR_TIM2RST    (1 <<  0) /* 00000001: Timer 2 reset */
#define CH32V103_RCC_APB1PRSTR_TIM3RST    (1 <<  1) /* 00000002: Timer 3 reset */
#define CH32V103_RCC_APB1PRSTR_TIM4RST    (1 <<  2) /* 00000004: Timer 4 reset */
#define CH32V103_RCC_APB1PRSTR_WWDGRST    (1 << 11) /* 00000800: Window watchdog reset */
#define CH32V103_RCC_APB1PRSTR_SPI2RST    (1 << 14) /* 00004000: SPI2 reset */
#define CH32V103_RCC_APB1PRSTR_USART2RST  (1 << 17) /* 00020000: USART 2 reset */
#define CH32V103_RCC_APB1PRSTR_USART3RST  (1 << 18) /* 00040000: USART 3 reset */
#define CH32V103_RCC_APB1PRSTR_I2C1RST    (1 << 21) /* 00200000: I2C1 reset */
#define CH32V103_RCC_APB1PRSTR_I2C2RST    (1 << 22) /* 00400000: I2C2 reset */
#define CH32V103_RCC_APB1PRSTR_USBDRST    (1 << 23) /* 00800000: USBD reset */
#define CH32V103_RCC_APB1PRSTR_CANRST     (1 << 25) /* 02000000: CAN reset */
#define CH32V103_RCC_APB1PRSTR_BKPRST     (1 << 27) /* 08000000: Backup interface reset */
#define CH32V103_RCC_APB1PRSTR_PWRRST     (1 << 28) /* 10000000: Power interface reset */
#define CH32V103_RCC_APB1PRSTR_DACRST     (1 << 29) /* 20000000: DAC interface reset */
#define CH32V103_RCC_AHBPCENR_OFFSET      0x0014
#define CH32V103_RCC_AHBPCENR             (CH32V103_RCC_BASE + CH32V103_RCC_AHBPCENR_OFFSET)
#define CH32V103_RCC_AHBPCENR_DMAEN       (1 <<  0) /* 00000001: DMA clock enable */
#define CH32V103_RCC_AHBPCENR_SRAMEN      (1 <<  2) /* 00000004: SRAM interface clock enable */
#define CH32V103_RCC_AHBPCENR_FLITFEN     (1 <<  4) /* 00000010: FLITF clock enable */
#define CH32V103_RCC_AHBPCENR_CRCEN       (1 <<  6) /* 00000040: CRC clock enable */
#define CH32V103_RCC_AHBPCENR_USBHDEN     (1 << 12) /* 00001000: USBHD clock enable */
#define CH32V103_RCC_APB2PCENR_OFFSET     0x0018
#define CH32V103_RCC_APB2PCENR            (CH32V103_RCC_BASE + CH32V103_RCC_APB2PCENR_OFFSET)
#define CH32V103_RCC_APB2PCENR_AFIOEN     (1 <<  0) /* 00000001: Alternate function I/O clock enable */
#define CH32V103_RCC_APB2PCENR_IOPAEN     (1 <<  2) /* 00000004: I/O port A clock enable */
#define CH32V103_RCC_APB2PCENR_IOPBEN     (1 <<  3) /* 00000008: I/O port B clock enable */
#define CH32V103_RCC_APB2PCENR_IOPCEN     (1 <<  4) /* 00000010: I/O port C clock enable */
#define CH32V103_RCC_APB2PCENR_IOPDEN     (1 <<  5) /* 00000020: I/O port D clock enable */
#define CH32V103_RCC_APB2PCENR_ADCEN      (1 <<  9) /* 00000200: ADC interface clock enable */
#define CH32V103_RCC_APB2PCENR_TIM1EN     (1 << 11) /* 00000800: TIM1 Timer clock enable */
#define CH32V103_RCC_APB2PCENR_SPI1EN     (1 << 12) /* 00001000: SPI 1 clock enable */
#define CH32V103_RCC_APB2PCENR_USART1EN   (1 << 14) /* 00004000: USART1 clock enable */
#define CH32V103_RCC_APB1PCENR_OFFSET     0x001c
#define CH32V103_RCC_APB1PCENR            (CH32V103_RCC_BASE + CH32V103_RCC_APB1PCENR_OFFSET)
#define CH32V103_RCC_APB1PCENR_TIM2EN     (1 <<  0) /* 00000001: Timer 2 clock enable */
#define CH32V103_RCC_APB1PCENR_TIM3EN     (1 <<  1) /* 00000002: Timer 3 clock enable */
#define CH32V103_RCC_APB1PCENR_TIM4EN     (1 <<  2) /* 00000004: Timer 4 clock enable */
#define CH32V103_RCC_APB1PCENR_WWDGEN     (1 << 11) /* 00000800: Window watchdog clock enable */
#define CH32V103_RCC_APB1PCENR_SPI2EN     (1 << 14) /* 00004000: SPI 2 clock enable */
#define CH32V103_RCC_APB1PCENR_USART2EN   (1 << 17) /* 00020000: USART 2 clock enable */
#define CH32V103_RCC_APB1PCENR_USART3EN   (1 << 18) /* 00040000: USART 3 clock enable */
#define CH32V103_RCC_APB1PCENR_I2C1EN     (1 << 21) /* 00200000: I2C 1 clock enable */
#define CH32V103_RCC_APB1PCENR_I2C2EN     (1 << 22) /* 00400000: I2C 2 clock enable */
#define CH32V103_RCC_APB1PCENR_USBDEN     (1 << 23) /* 00800000: USBD clock enable */
#define CH32V103_RCC_APB1PCENR_CANEN      (1 << 25) /* 02000000: CAN clock enable */
#define CH32V103_RCC_APB1PCENR_BKPEN      (1 << 27) /* 08000000: Backup interface clock enable */
#define CH32V103_RCC_APB1PCENR_PWREN      (1 << 28) /* 10000000: Power interface clock enable */
#define CH32V103_RCC_APB1PCENR_DACEN      (1 << 29) /* 20000000: DAC interface clock enable */
#define CH32V103_RCC_BDCTLR_OFFSET        0x0020
#define CH32V103_RCC_BDCTLR               (CH32V103_RCC_BASE + CH32V103_RCC_BDCTLR_OFFSET)
#define CH32V103_RCC_BDCTLR_LSEON         (1 <<  0) /* 00000001: External Low Speed oscillator enable */
#define CH32V103_RCC_BDCTLR_LSERDY        (1 <<  1) /* 00000002: External Low Speed oscillator ready */
#define CH32V103_RCC_BDCTLR_LSEBYP        (1 <<  2) /* 00000004: External Low Speed oscillator bypass */
#define CH32V103_RCC_BDCTLR_RTCSEL        (0x3 << 8) /* 00000300: RTC clock source selection */
#define CH32V103_RCC_BDCTLR_RTCSEL_MASK   (0x3 << 8)
#define CH32V103_RCC_BDCTLR_RTCEN         (1 << 15) /* 00008000: RTC clock enable */
#define CH32V103_RCC_BDCTLR_BDRST         (1 << 16) /* 00010000: Backup domain software reset */
#define CH32V103_RCC_RSTSCKR_OFFSET       0x0024
#define CH32V103_RCC_RSTSCKR              (CH32V103_RCC_BASE + CH32V103_RCC_RSTSCKR_OFFSET)
#define CH32V103_RCC_RSTSCKR_LSION        (1 <<  0) /* 00000001: Internal low speed oscillator enable */
#define CH32V103_RCC_RSTSCKR_LSIRDY       (1 <<  1) /* 00000002: Internal low speed oscillator ready */
#define CH32V103_RCC_RSTSCKR_RMVF         (1 << 24) /* 01000000: Remove reset flag */
#define CH32V103_RCC_RSTSCKR_PINRSTF      (1 << 26) /* 04000000: PIN reset flag */
#define CH32V103_RCC_RSTSCKR_PORRSTF      (1 << 27) /* 08000000: POR/PDR reset flag */
#define CH32V103_RCC_RSTSCKR_SFTRSTF      (1 << 28) /* 10000000: Software reset flag */
#define CH32V103_RCC_RSTSCKR_IWDGRSTF     (1 << 29) /* 20000000: Independent watchdog reset flag */
#define CH32V103_RCC_RSTSCKR_WWDGRSTF     (1 << 30) /* 40000000: Window watchdog reset flag */
#define CH32V103_RCC_RSTSCKR_LPWRRSTF     (1 << 31) /* 80000000: Low-power reset flag */
#define CH32V103_RCC_AHBRSTR_OFFSET       0x0028
#define CH32V103_RCC_AHBRSTR              (CH32V103_RCC_BASE + CH32V103_RCC_AHBRSTR_OFFSET)
#define CH32V103_RCC_AHBRSTR_USBHDRST     (1 << 12) /* 00001000: USBHD reset */

/* EXTEND - extension configuration */
#define CH32V103_EXTEND_BASE              0x40023800
#define CH32V103_EXTEND_EXTEND_CTR_OFFSET 0x0000
#define CH32V103_EXTEND_EXTEND_CTR        (CH32V103_EXTEND_BASE + CH32V103_EXTEND_EXTEND_CTR_OFFSET)
#define CH32V103_EXTEND_EXTEND_CTR_USBDLS (1 <<  0) /* 00000001: USBD Lowspeed Enable */
#define CH32V103_EXTEND_EXTEND_CTR_USBDPU (1 <<  1) /* 00000002: USBD pullup Enable */
#define CH32V103_EXTEND_EXTEND_CTR_USBHDIO (1 <<  2) /* 00000004: USBHD IO(PB6/PB7) Enable */
#define CH32V103_EXTEND_EXTEND_CTR_USB5VSEL (1 <<  3) /* 00000008: USB 5V Enable */
#define CH32V103_EXTEND_EXTEND_CTR_HSIPRE (1 <<  4) /* 00000010: Whether HSI is divided */
#define CH32V103_EXTEND_EXTEND_CTR_LKUPEN (1 <<  6) /* 00000040: LOCKUP */
#define CH32V103_EXTEND_EXTEND_CTR_LKUPRESET (1 <<  7) /* 00000080: LOCKUP RESET */
#define CH32V103_EXTEND_EXTEND_CTR_ULLDOTRIM (0x3 << 8) /* 00000300: ULLDOTRIM */
#define CH32V103_EXTEND_EXTEND_CTR_ULLDOTRIM_MASK (0x3 << 8)
#define CH32V103_EXTEND_EXTEND_CTR_LDOTRIM (1 << 10) /* 00000400: LDOTRIM */

