robertlipe/svdtoheaders/demo/h/ch32v103_reg.h
/* GPIOA - General purpose I/O */
#define CH32V103_GPIOA_BASE               0x40010800
#define CH32V103_GPIOA_CFGLR_OFFSET       0x0000
#define CH32V103_GPIOA_CFGLR              (CH32V103_GPIOA_BASE + CH32V103_GPIOA_CFGLR_OFFSET)
#define CH32V103_GPIOA_CFGLR_MODE0        (0x3 << 0) /* 00000003: Port n.0 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE0_MASK   (0x3 << 0)
#define CH32V103_GPIOA_CFGLR_CNF0         (0x3 << 2) /* 0000000c: Port n.0 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF0_MASK    (0x3 << 2)
#define CH32V103_GPIOA_CFGLR_MODE1        (0x3 << 4) /* 00000030: Port n.1 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE1_MASK   (0x3 << 4)
#define CH32V103_GPIOA_CFGLR_CNF1         (0x3 << 6) /* 000000c0: Port n.1 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF1_MASK    (0x3 << 6)
#define CH32V103_GPIOA_CFGLR_MODE2        (0x3 << 8) /* 00000300: Port n.2 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE2_MASK   (0x3 << 8)
#define CH32V103_GPIOA_CFGLR_CNF2         (0x3 << 10) /* 00000c00: Port n.2 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF2_MASK    (0x3 << 10)
#define CH32V103_GPIOA_CFGLR_MODE3        (0x3 << 12) /* 00003000: Port n.3 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE3_MASK   (0x3 << 12)
#define CH32V103_GPIOA_CFGLR_CNF3         (0x3 << 14) /* 0000c000: Port n.3 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF3_MASK    (0x3 << 14)
#define CH32V103_GPIOA_CFGLR_MODE4        (0x3 << 16) /* 00030000: Port n.4 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE4_MASK   (0x3 << 16)
#define CH32V103_GPIOA_CFGLR_CNF4         (0x3 << 18) /* 000c0000: Port n.4 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF4_MASK    (0x3 << 18)
#define CH32V103_GPIOA_CFGLR_MODE5        (0x3 << 20) /* 00300000: Port n.5 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE5_MASK   (0x3 << 20)
#define CH32V103_GPIOA_CFGLR_CNF5         (0x3 << 22) /* 00c00000: Port n.5 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF5_MASK    (0x3 << 22)
#define CH32V103_GPIOA_CFGLR_MODE6        (0x3 << 24) /* 03000000: Port n.6 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE6_MASK   (0x3 << 24)
#define CH32V103_GPIOA_CFGLR_CNF6         (0x3 << 26) /* 0c000000: Port n.6 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF6_MASK    (0x3 << 26)
#define CH32V103_GPIOA_CFGLR_MODE7        (0x3 << 28) /* 30000000: Port n.7 mode bits */
#define CH32V103_GPIOA_CFGLR_MODE7_MASK   (0x3 << 28)
#define CH32V103_GPIOA_CFGLR_CNF7         (0x3 << 30) /* c0000000: Port n.7 configuration bits */
#define CH32V103_GPIOA_CFGLR_CNF7_MASK    (0x3 << 30)
#define CH32V103_GPIOA_CFGHR_OFFSET       0x0004
#define CH32V103_GPIOA_CFGHR              (CH32V103_GPIOA_BASE + CH32V103_GPIOA_CFGHR_OFFSET)
#define CH32V103_GPIOA_CFGHR_MODE8        (0x3 << 0) /* 00000003: Port n.8 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE8_MASK   (0x3 << 0)
#define CH32V103_GPIOA_CFGHR_CNF8         (0x3 << 2) /* 0000000c: Port n.8 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF8_MASK    (0x3 << 2)
#define CH32V103_GPIOA_CFGHR_MODE9        (0x3 << 4) /* 00000030: Port n.9 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE9_MASK   (0x3 << 4)
#define CH32V103_GPIOA_CFGHR_CNF9         (0x3 << 6) /* 000000c0: Port n.9 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF9_MASK    (0x3 << 6)
#define CH32V103_GPIOA_CFGHR_MODE10       (0x3 << 8) /* 00000300: Port n.10 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE10_MASK  (0x3 << 8)
#define CH32V103_GPIOA_CFGHR_CNF10        (0x3 << 10) /* 00000c00: Port n.10 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF10_MASK   (0x3 << 10)
#define CH32V103_GPIOA_CFGHR_MODE11       (0x3 << 12) /* 00003000: Port n.11 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE11_MASK  (0x3 << 12)
#define CH32V103_GPIOA_CFGHR_CNF11        (0x3 << 14) /* 0000c000: Port n.11 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF11_MASK   (0x3 << 14)
#define CH32V103_GPIOA_CFGHR_MODE12       (0x3 << 16) /* 00030000: Port n.12 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE12_MASK  (0x3 << 16)
#define CH32V103_GPIOA_CFGHR_CNF12        (0x3 << 18) /* 000c0000: Port n.12 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF12_MASK   (0x3 << 18)
#define CH32V103_GPIOA_CFGHR_MODE13       (0x3 << 20) /* 00300000: Port n.13 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE13_MASK  (0x3 << 20)
#define CH32V103_GPIOA_CFGHR_CNF13        (0x3 << 22) /* 00c00000: Port n.13 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF13_MASK   (0x3 << 22)
#define CH32V103_GPIOA_CFGHR_MODE14       (0x3 << 24) /* 03000000: Port n.14 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE14_MASK  (0x3 << 24)
#define CH32V103_GPIOA_CFGHR_CNF14        (0x3 << 26) /* 0c000000: Port n.14 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF14_MASK   (0x3 << 26)
#define CH32V103_GPIOA_CFGHR_MODE15       (0x3 << 28) /* 30000000: Port n.15 mode bits */
#define CH32V103_GPIOA_CFGHR_MODE15_MASK  (0x3 << 28)
#define CH32V103_GPIOA_CFGHR_CNF15        (0x3 << 30) /* c0000000: Port n.15 configuration bits */
#define CH32V103_GPIOA_CFGHR_CNF15_MASK   (0x3 << 30)
#define CH32V103_GPIOA_INDR_OFFSET        0x0008
#define CH32V103_GPIOA_INDR               (CH32V103_GPIOA_BASE + CH32V103_GPIOA_INDR_OFFSET)
#define CH32V103_GPIOA_INDR_IDR0          (1 <<  0) /* 00000001: Port input data */
#define CH32V103_GPIOA_INDR_IDR1          (1 <<  1) /* 00000002: Port input data */
#define CH32V103_GPIOA_INDR_IDR2          (1 <<  2) /* 00000004: Port input data */
#define CH32V103_GPIOA_INDR_IDR3          (1 <<  3) /* 00000008: Port input data */
#define CH32V103_GPIOA_INDR_IDR4          (1 <<  4) /* 00000010: Port input data */
#define CH32V103_GPIOA_INDR_IDR5          (1 <<  5) /* 00000020: Port input data */
#define CH32V103_GPIOA_INDR_IDR6          (1 <<  6) /* 00000040: Port input data */
#define CH32V103_GPIOA_INDR_IDR7          (1 <<  7) /* 00000080: Port input data */
#define CH32V103_GPIOA_INDR_IDR8          (1 <<  8) /* 00000100: Port input data */
#define CH32V103_GPIOA_INDR_IDR9          (1 <<  9) /* 00000200: Port input data */
#define CH32V103_GPIOA_INDR_IDR10         (1 << 10) /* 00000400: Port input data */
#define CH32V103_GPIOA_INDR_IDR11         (1 << 11) /* 00000800: Port input data */
#define CH32V103_GPIOA_INDR_IDR12         (1 << 12) /* 00001000: Port input data */
#define CH32V103_GPIOA_INDR_IDR13         (1 << 13) /* 00002000: Port input data */
#define CH32V103_GPIOA_INDR_IDR14         (1 << 14) /* 00004000: Port input data */
#define CH32V103_GPIOA_INDR_IDR15         (1 << 15) /* 00008000: Port input data */
#define CH32V103_GPIOA_OUTDR_OFFSET       0x000c
#define CH32V103_GPIOA_OUTDR              (CH32V103_GPIOA_BASE + CH32V103_GPIOA_OUTDR_OFFSET)
#define CH32V103_GPIOA_OUTDR_ODR0         (1 <<  0) /* 00000001: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR1         (1 <<  1) /* 00000002: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR2         (1 <<  2) /* 00000004: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR3         (1 <<  3) /* 00000008: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR4         (1 <<  4) /* 00000010: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR5         (1 <<  5) /* 00000020: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR6         (1 <<  6) /* 00000040: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR7         (1 <<  7) /* 00000080: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR8         (1 <<  8) /* 00000100: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR9         (1 <<  9) /* 00000200: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR10        (1 << 10) /* 00000400: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR11        (1 << 11) /* 00000800: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR12        (1 << 12) /* 00001000: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR13        (1 << 13) /* 00002000: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR14        (1 << 14) /* 00004000: Port output data */
#define CH32V103_GPIOA_OUTDR_ODR15        (1 << 15) /* 00008000: Port output data */
#define CH32V103_GPIOA_BSHR_OFFSET        0x0010
#define CH32V103_GPIOA_BSHR               (CH32V103_GPIOA_BASE + CH32V103_GPIOA_BSHR_OFFSET)
#define CH32V103_GPIOA_BSHR_BS0           (1 <<  0) /* 00000001: Set bit 0 */
#define CH32V103_GPIOA_BSHR_BS1           (1 <<  1) /* 00000002: Set bit 1 */
#define CH32V103_GPIOA_BSHR_BS2           (1 <<  2) /* 00000004: Set bit 1 */
#define CH32V103_GPIOA_BSHR_BS3           (1 <<  3) /* 00000008: Set bit 3 */
#define CH32V103_GPIOA_BSHR_BS4           (1 <<  4) /* 00000010: Set bit 4 */
#define CH32V103_GPIOA_BSHR_BS5           (1 <<  5) /* 00000020: Set bit 5 */
#define CH32V103_GPIOA_BSHR_BS6           (1 <<  6) /* 00000040: Set bit 6 */
#define CH32V103_GPIOA_BSHR_BS7           (1 <<  7) /* 00000080: Set bit 7 */
#define CH32V103_GPIOA_BSHR_BS8           (1 <<  8) /* 00000100: Set bit 8 */
#define CH32V103_GPIOA_BSHR_BS9           (1 <<  9) /* 00000200: Set bit 9 */
#define CH32V103_GPIOA_BSHR_BS10          (1 << 10) /* 00000400: Set bit 10 */
#define CH32V103_GPIOA_BSHR_BS11          (1 << 11) /* 00000800: Set bit 11 */
#define CH32V103_GPIOA_BSHR_BS12          (1 << 12) /* 00001000: Set bit 12 */
#define CH32V103_GPIOA_BSHR_BS13          (1 << 13) /* 00002000: Set bit 13 */
#define CH32V103_GPIOA_BSHR_BS14          (1 << 14) /* 00004000: Set bit 14 */
#define CH32V103_GPIOA_BSHR_BS15          (1 << 15) /* 00008000: Set bit 15 */
#define CH32V103_GPIOA_BSHR_BR0           (1 << 16) /* 00010000: Reset bit 0 */
#define CH32V103_GPIOA_BSHR_BR1           (1 << 17) /* 00020000: Reset bit 1 */
#define CH32V103_GPIOA_BSHR_BR2           (1 << 18) /* 00040000: Reset bit 2 */
#define CH32V103_GPIOA_BSHR_BR3           (1 << 19) /* 00080000: Reset bit 3 */
#define CH32V103_GPIOA_BSHR_BR4           (1 << 20) /* 00100000: Reset bit 4 */
#define CH32V103_GPIOA_BSHR_BR5           (1 << 21) /* 00200000: Reset bit 5 */
#define CH32V103_GPIOA_BSHR_BR6           (1 << 22) /* 00400000: Reset bit 6 */
#define CH32V103_GPIOA_BSHR_BR7           (1 << 23) /* 00800000: Reset bit 7 */
#define CH32V103_GPIOA_BSHR_BR8           (1 << 24) /* 01000000: Reset bit 8 */
#define CH32V103_GPIOA_BSHR_BR9           (1 << 25) /* 02000000: Reset bit 9 */
#define CH32V103_GPIOA_BSHR_BR10          (1 << 26) /* 04000000: Reset bit 10 */
#define CH32V103_GPIOA_BSHR_BR11          (1 << 27) /* 08000000: Reset bit 11 */
#define CH32V103_GPIOA_BSHR_BR12          (1 << 28) /* 10000000: Reset bit 12 */
#define CH32V103_GPIOA_BSHR_BR13          (1 << 29) /* 20000000: Reset bit 13 */
#define CH32V103_GPIOA_BSHR_BR14          (1 << 30) /* 40000000: Reset bit 14 */
#define CH32V103_GPIOA_BSHR_BR15          (1 << 31) /* 80000000: Reset bit 15 */
#define CH32V103_GPIOA_BCR_OFFSET         0x0014
#define CH32V103_GPIOA_BCR                (CH32V103_GPIOA_BASE + CH32V103_GPIOA_BCR_OFFSET)
#define CH32V103_GPIOA_BCR_BR0            (1 <<  0) /* 00000001: Reset bit 0 */
#define CH32V103_GPIOA_BCR_BR1            (1 <<  1) /* 00000002: Reset bit 1 */
#define CH32V103_GPIOA_BCR_BR2            (1 <<  2) /* 00000004: Reset bit 1 */
#define CH32V103_GPIOA_BCR_BR3            (1 <<  3) /* 00000008: Reset bit 3 */
#define CH32V103_GPIOA_BCR_BR4            (1 <<  4) /* 00000010: Reset bit 4 */
#define CH32V103_GPIOA_BCR_BR5            (1 <<  5) /* 00000020: Reset bit 5 */
#define CH32V103_GPIOA_BCR_BR6            (1 <<  6) /* 00000040: Reset bit 6 */
#define CH32V103_GPIOA_BCR_BR7            (1 <<  7) /* 00000080: Reset bit 7 */
#define CH32V103_GPIOA_BCR_BR8            (1 <<  8) /* 00000100: Reset bit 8 */
#define CH32V103_GPIOA_BCR_BR9            (1 <<  9) /* 00000200: Reset bit 9 */
#define CH32V103_GPIOA_BCR_BR10           (1 << 10) /* 00000400: Reset bit 10 */
#define CH32V103_GPIOA_BCR_BR11           (1 << 11) /* 00000800: Reset bit 11 */
#define CH32V103_GPIOA_BCR_BR12           (1 << 12) /* 00001000: Reset bit 12 */
#define CH32V103_GPIOA_BCR_BR13           (1 << 13) /* 00002000: Reset bit 13 */
#define CH32V103_GPIOA_BCR_BR14           (1 << 14) /* 00004000: Reset bit 14 */
#define CH32V103_GPIOA_BCR_BR15           (1 << 15) /* 00008000: Reset bit 15 */
#define CH32V103_GPIOA_LCKR_OFFSET        0x0018
#define CH32V103_GPIOA_LCKR               (CH32V103_GPIOA_BASE + CH32V103_GPIOA_LCKR_OFFSET)
#define CH32V103_GPIOA_LCKR_LCK0          (1 <<  0) /* 00000001: Port A Lock bit 0 */
#define CH32V103_GPIOA_LCKR_LCK1          (1 <<  1) /* 00000002: Port A Lock bit 1 */
#define CH32V103_GPIOA_LCKR_LCK2          (1 <<  2) /* 00000004: Port A Lock bit 2 */
#define CH32V103_GPIOA_LCKR_LCK3          (1 <<  3) /* 00000008: Port A Lock bit 3 */
#define CH32V103_GPIOA_LCKR_LCK4          (1 <<  4) /* 00000010: Port A Lock bit 4 */
#define CH32V103_GPIOA_LCKR_LCK5          (1 <<  5) /* 00000020: Port A Lock bit 5 */
#define CH32V103_GPIOA_LCKR_LCK6          (1 <<  6) /* 00000040: Port A Lock bit 6 */
#define CH32V103_GPIOA_LCKR_LCK7          (1 <<  7) /* 00000080: Port A Lock bit 7 */
#define CH32V103_GPIOA_LCKR_LCK8          (1 <<  8) /* 00000100: Port A Lock bit 8 */
#define CH32V103_GPIOA_LCKR_LCK9          (1 <<  9) /* 00000200: Port A Lock bit 9 */
#define CH32V103_GPIOA_LCKR_LCK10         (1 << 10) /* 00000400: Port A Lock bit 10 */
#define CH32V103_GPIOA_LCKR_LCK11         (1 << 11) /* 00000800: Port A Lock bit 11 */
#define CH32V103_GPIOA_LCKR_LCK12         (1 << 12) /* 00001000: Port A Lock bit 12 */
#define CH32V103_GPIOA_LCKR_LCK13         (1 << 13) /* 00002000: Port A Lock bit 13 */
#define CH32V103_GPIOA_LCKR_LCK14         (1 << 14) /* 00004000: Port A Lock bit 14 */
#define CH32V103_GPIOA_LCKR_LCK15         (1 << 15) /* 00008000: Port A Lock bit 15 */
#define CH32V103_GPIOA_LCKR_LCKK          (1 << 16) /* 00010000: Lock key */

