robertlipe/svdtoheaders/demo/h/ch32v103_reg.h
/* AFIO - Alternate function I/O */
#define CH32V103_AFIO_BASE                0x40010000
#define CH32V103_AFIO_ECR_OFFSET          0x0000
#define CH32V103_AFIO_ECR                 (CH32V103_AFIO_BASE + CH32V103_AFIO_ECR_OFFSET)
#define CH32V103_AFIO_ECR_PIN             (0xf << 0) /* 0000000f: Pin selection */
#define CH32V103_AFIO_ECR_PIN_MASK        (0xf << 0)
#define CH32V103_AFIO_ECR_PORT            (0x7 << 4) /* 00000070: Port selection */
#define CH32V103_AFIO_ECR_PORT_MASK       (0x7 << 4)
#define CH32V103_AFIO_ECR_EVOE            (1 <<  7) /* 00000080: Event Output Enable */
#define CH32V103_AFIO_PCFR1_OFFSET        0x0004
#define CH32V103_AFIO_PCFR1               (CH32V103_AFIO_BASE + CH32V103_AFIO_PCFR1_OFFSET)
#define CH32V103_AFIO_PCFR1_SPI1_REMAP    (1 <<  0) /* 00000001: SPI1 remapping */
#define CH32V103_AFIO_PCFR1_I2C1_REMAP    (1 <<  1) /* 00000002: I2C1 remapping */
#define CH32V103_AFIO_PCFR1_USART1_REMAP  (1 <<  2) /* 00000004: USART1 remapping */
#define CH32V103_AFIO_PCFR1_USART2_REMAP  (1 <<  3) /* 00000008: USART2 remapping */
#define CH32V103_AFIO_PCFR1_USART3_REMAP  (0x3 << 4) /* 00000030: USART3 remapping */
#define CH32V103_AFIO_PCFR1_USART3_REMAP_MASK (0x3 << 4)
#define CH32V103_AFIO_PCFR1_TIM1_REMAP    (0x3 << 6) /* 000000c0: TIM1 remapping */
#define CH32V103_AFIO_PCFR1_TIM1_REMAP_MASK (0x3 << 6)
#define CH32V103_AFIO_PCFR1_TIM2_REMAP    (0x3 << 8) /* 00000300: TIM2 remapping */
#define CH32V103_AFIO_PCFR1_TIM2_REMAP_MASK (0x3 << 8)
#define CH32V103_AFIO_PCFR1_TIM3_REMAP    (0x3 << 10) /* 00000c00: TIM3 remapping */
#define CH32V103_AFIO_PCFR1_TIM3_REMAP_MASK (0x3 << 10)
#define CH32V103_AFIO_PCFR1_TIM4_REMAP    (1 << 12) /* 00001000: TIM4 remapping */
#define CH32V103_AFIO_PCFR1_CAN_REMAP     (0x3 << 13) /* 00006000: CAN1 remapping */
#define CH32V103_AFIO_PCFR1_CAN_REMAP_MASK (0x3 << 13)
#define CH32V103_AFIO_PCFR1_PD01_REMAP    (1 << 15) /* 00008000: Port D0/Port D1 mapping on OSCIN/OSCOUT */
#define CH32V103_AFIO_PCFR1_TIM5CH4_IREMAP (1 << 16) /* 00010000: Set and cleared by software */
#define CH32V103_AFIO_PCFR1_ADC1_ETRGINJ_REMAP (1 << 17) /* 00020000: ADC 1 External trigger injected conversion remapping */
#define CH32V103_AFIO_PCFR1_ADC1_ETRGREG_REMAP (1 << 18) /* 00040000: ADC 1 external trigger regular conversion remapping */
#define CH32V103_AFIO_PCFR1_ADC2_ETRGINJ_REMAP (1 << 19) /* 00080000: ADC 2 external trigger injected conversion remapping */
#define CH32V103_AFIO_PCFR1_ADC2_ETRGREG_REMAP (1 << 20) /* 00100000: ADC 2 external trigger regular conversion remapping */
#define CH32V103_AFIO_PCFR1_SWJ_CFG       (0x7 << 24) /* 07000000: Serial wire JTAG configuration */
#define CH32V103_AFIO_PCFR1_SWJ_CFG_MASK  (0x7 << 24)
#define CH32V103_AFIO_EXTICR1_OFFSET      0x0008
#define CH32V103_AFIO_EXTICR1             (CH32V103_AFIO_BASE + CH32V103_AFIO_EXTICR1_OFFSET)
#define CH32V103_AFIO_EXTICR1_EXTI0       (0xf << 0) /* 0000000f: EXTI0 configuration */
#define CH32V103_AFIO_EXTICR1_EXTI0_MASK  (0xf << 0)
#define CH32V103_AFIO_EXTICR1_EXTI1       (0xf << 4) /* 000000f0: EXTI1 configuration */
#define CH32V103_AFIO_EXTICR1_EXTI1_MASK  (0xf << 4)
#define CH32V103_AFIO_EXTICR1_EXTI2       (0xf << 8) /* 00000f00: EXTI2 configuration */
#define CH32V103_AFIO_EXTICR1_EXTI2_MASK  (0xf << 8)
#define CH32V103_AFIO_EXTICR1_EXTI3       (0xf << 12) /* 0000f000: EXTI3 configuration */
#define CH32V103_AFIO_EXTICR1_EXTI3_MASK  (0xf << 12)
#define CH32V103_AFIO_EXTICR2_OFFSET      0x000c
#define CH32V103_AFIO_EXTICR2             (CH32V103_AFIO_BASE + CH32V103_AFIO_EXTICR2_OFFSET)
#define CH32V103_AFIO_EXTICR2_EXTI4       (0xf << 0) /* 0000000f: EXTI4 configuration */
#define CH32V103_AFIO_EXTICR2_EXTI4_MASK  (0xf << 0)
#define CH32V103_AFIO_EXTICR2_EXTI5       (0xf << 4) /* 000000f0: EXTI5 configuration */
#define CH32V103_AFIO_EXTICR2_EXTI5_MASK  (0xf << 4)
#define CH32V103_AFIO_EXTICR2_EXTI6       (0xf << 8) /* 00000f00: EXTI6 configuration */
#define CH32V103_AFIO_EXTICR2_EXTI6_MASK  (0xf << 8)
#define CH32V103_AFIO_EXTICR2_EXTI7       (0xf << 12) /* 0000f000: EXTI7 configuration */
#define CH32V103_AFIO_EXTICR2_EXTI7_MASK  (0xf << 12)
#define CH32V103_AFIO_EXTICR3_OFFSET      0x0010
#define CH32V103_AFIO_EXTICR3             (CH32V103_AFIO_BASE + CH32V103_AFIO_EXTICR3_OFFSET)
#define CH32V103_AFIO_EXTICR3_EXTI8       (0xf << 0) /* 0000000f: EXTI8 configuration */
#define CH32V103_AFIO_EXTICR3_EXTI8_MASK  (0xf << 0)
#define CH32V103_AFIO_EXTICR3_EXTI9       (0xf << 4) /* 000000f0: EXTI9 configuration */
#define CH32V103_AFIO_EXTICR3_EXTI9_MASK  (0xf << 4)
#define CH32V103_AFIO_EXTICR3_EXTI10      (0xf << 8) /* 00000f00: EXTI10 configuration */
#define CH32V103_AFIO_EXTICR3_EXTI10_MASK (0xf << 8)
#define CH32V103_AFIO_EXTICR3_EXTI11      (0xf << 12) /* 0000f000: EXTI11 configuration */
#define CH32V103_AFIO_EXTICR3_EXTI11_MASK (0xf << 12)
#define CH32V103_AFIO_EXTICR4_OFFSET      0x0014
#define CH32V103_AFIO_EXTICR4             (CH32V103_AFIO_BASE + CH32V103_AFIO_EXTICR4_OFFSET)
#define CH32V103_AFIO_EXTICR4_EXTI12      (0xf << 0) /* 0000000f: EXTI12 configuration */
#define CH32V103_AFIO_EXTICR4_EXTI12_MASK (0xf << 0)
#define CH32V103_AFIO_EXTICR4_EXTI13      (0xf << 4) /* 000000f0: EXTI13 configuration */
#define CH32V103_AFIO_EXTICR4_EXTI13_MASK (0xf << 4)
#define CH32V103_AFIO_EXTICR4_EXTI14      (0xf << 8) /* 00000f00: EXTI14 configuration */
#define CH32V103_AFIO_EXTICR4_EXTI14_MASK (0xf << 8)
#define CH32V103_AFIO_EXTICR4_EXTI15      (0xf << 12) /* 0000f000: EXTI15 configuration */
#define CH32V103_AFIO_EXTICR4_EXTI15_MASK (0xf << 12)
#define CH32V103_AFIO_PCFR2_OFFSET        0x001c
#define CH32V103_AFIO_PCFR2               (CH32V103_AFIO_BASE + CH32V103_AFIO_PCFR2_OFFSET)
#define CH32V103_AFIO_PCFR2_TIM9_REMAP    (1 <<  5) /* 00000020: TIM9 remapping */
#define CH32V103_AFIO_PCFR2_TIM10_REMAP   (1 <<  6) /* 00000040: TIM10 remapping */
#define CH32V103_AFIO_PCFR2_TIM11_REMAP   (1 <<  7) /* 00000080: TIM11 remapping */
#define CH32V103_AFIO_PCFR2_TIM13_REMAP   (1 <<  8) /* 00000100: TIM13 remapping */
#define CH32V103_AFIO_PCFR2_TIM14_REMAP   (1 <<  9) /* 00000200: TIM14 remapping */
#define CH32V103_AFIO_PCFR2_FSMC_NADV     (1 << 10) /* 00000400: NADV connect/disconnect */

/* EXTI - EXTI */
#define CH32V103_EXTI_BASE                0x40010400
#define CH32V103_EXTI_INTENR_OFFSET       0x0000
#define CH32V103_EXTI_INTENR              (CH32V103_EXTI_BASE + CH32V103_EXTI_INTENR_OFFSET)
#define CH32V103_EXTI_INTENR_MR0          (1 <<  0) /* 00000001: Interrupt Mask on line 0 */
#define CH32V103_EXTI_INTENR_MR1          (1 <<  1) /* 00000002: Interrupt Mask on line 1 */
#define CH32V103_EXTI_INTENR_MR2          (1 <<  2) /* 00000004: Interrupt Mask on line 2 */
#define CH32V103_EXTI_INTENR_MR3          (1 <<  3) /* 00000008: Interrupt Mask on line 3 */
#define CH32V103_EXTI_INTENR_MR4          (1 <<  4) /* 00000010: Interrupt Mask on line 4 */
#define CH32V103_EXTI_INTENR_MR5          (1 <<  5) /* 00000020: Interrupt Mask on line 5 */
#define CH32V103_EXTI_INTENR_MR6          (1 <<  6) /* 00000040: Interrupt Mask on line 6 */
#define CH32V103_EXTI_INTENR_MR7          (1 <<  7) /* 00000080: Interrupt Mask on line 7 */
#define CH32V103_EXTI_INTENR_MR8          (1 <<  8) /* 00000100: Interrupt Mask on line 8 */
#define CH32V103_EXTI_INTENR_MR9          (1 <<  9) /* 00000200: Interrupt Mask on line 9 */
#define CH32V103_EXTI_INTENR_MR10         (1 << 10) /* 00000400: Interrupt Mask on line 10 */
#define CH32V103_EXTI_INTENR_MR11         (1 << 11) /* 00000800: Interrupt Mask on line 11 */
#define CH32V103_EXTI_INTENR_MR12         (1 << 12) /* 00001000: Interrupt Mask on line 12 */
#define CH32V103_EXTI_INTENR_MR13         (1 << 13) /* 00002000: Interrupt Mask on line 13 */
#define CH32V103_EXTI_INTENR_MR14         (1 << 14) /* 00004000: Interrupt Mask on line 14 */
#define CH32V103_EXTI_INTENR_MR15         (1 << 15) /* 00008000: Interrupt Mask on line 15 */
#define CH32V103_EXTI_INTENR_MR16         (1 << 16) /* 00010000: Interrupt Mask on line 16 */
#define CH32V103_EXTI_INTENR_MR17         (1 << 17) /* 00020000: Interrupt Mask on line 17 */
#define CH32V103_EXTI_INTENR_MR18         (1 << 18) /* 00040000: Interrupt Mask on line 18 */
#define CH32V103_EXTI_EVENR_OFFSET        0x0004
#define CH32V103_EXTI_EVENR               (CH32V103_EXTI_BASE + CH32V103_EXTI_EVENR_OFFSET)
#define CH32V103_EXTI_EVENR_MR0           (1 <<  0) /* 00000001: Event Mask on line 0 */
#define CH32V103_EXTI_EVENR_MR1           (1 <<  1) /* 00000002: Event Mask on line 1 */
#define CH32V103_EXTI_EVENR_MR2           (1 <<  2) /* 00000004: Event Mask on line 2 */
#define CH32V103_EXTI_EVENR_MR3           (1 <<  3) /* 00000008: Event Mask on line 3 */
#define CH32V103_EXTI_EVENR_MR4           (1 <<  4) /* 00000010: Event Mask on line 4 */
#define CH32V103_EXTI_EVENR_MR5           (1 <<  5) /* 00000020: Event Mask on line 5 */
#define CH32V103_EXTI_EVENR_MR6           (1 <<  6) /* 00000040: Event Mask on line 6 */
#define CH32V103_EXTI_EVENR_MR7           (1 <<  7) /* 00000080: Event Mask on line 7 */
#define CH32V103_EXTI_EVENR_MR8           (1 <<  8) /* 00000100: Event Mask on line 8 */
#define CH32V103_EXTI_EVENR_MR9           (1 <<  9) /* 00000200: Event Mask on line 9 */
#define CH32V103_EXTI_EVENR_MR10          (1 << 10) /* 00000400: Event Mask on line 10 */
#define CH32V103_EXTI_EVENR_MR11          (1 << 11) /* 00000800: Event Mask on line 11 */
#define CH32V103_EXTI_EVENR_MR12          (1 << 12) /* 00001000: Event Mask on line 12 */
#define CH32V103_EXTI_EVENR_MR13          (1 << 13) /* 00002000: Event Mask on line 13 */
#define CH32V103_EXTI_EVENR_MR14          (1 << 14) /* 00004000: Event Mask on line 14 */
#define CH32V103_EXTI_EVENR_MR15          (1 << 15) /* 00008000: Event Mask on line 15 */
#define CH32V103_EXTI_EVENR_MR16          (1 << 16) /* 00010000: Event Mask on line 16 */
#define CH32V103_EXTI_EVENR_MR17          (1 << 17) /* 00020000: Event Mask on line 17 */
#define CH32V103_EXTI_EVENR_MR18          (1 << 18) /* 00040000: Event Mask on line 18 */
#define CH32V103_EXTI_RTENR_OFFSET        0x0008
#define CH32V103_EXTI_RTENR               (CH32V103_EXTI_BASE + CH32V103_EXTI_RTENR_OFFSET)
#define CH32V103_EXTI_RTENR_TR0           (1 <<  0) /* 00000001: Rising trigger event configuration of line 0 */
#define CH32V103_EXTI_RTENR_TR1           (1 <<  1) /* 00000002: Rising trigger event configuration of line 1 */
#define CH32V103_EXTI_RTENR_TR2           (1 <<  2) /* 00000004: Rising trigger event configuration of line 2 */
#define CH32V103_EXTI_RTENR_TR3           (1 <<  3) /* 00000008: Rising trigger event configuration of line 3 */
#define CH32V103_EXTI_RTENR_TR4           (1 <<  4) /* 00000010: Rising trigger event configuration of line 4 */
#define CH32V103_EXTI_RTENR_TR5           (1 <<  5) /* 00000020: Rising trigger event configuration of line 5 */
#define CH32V103_EXTI_RTENR_TR6           (1 <<  6) /* 00000040: Rising trigger event configuration of line 6 */
#define CH32V103_EXTI_RTENR_TR7           (1 <<  7) /* 00000080: Rising trigger event configuration of line 7 */
#define CH32V103_EXTI_RTENR_TR8           (1 <<  8) /* 00000100: Rising trigger event configuration of line 8 */
#define CH32V103_EXTI_RTENR_TR9           (1 <<  9) /* 00000200: Rising trigger event configuration of line 9 */
#define CH32V103_EXTI_RTENR_TR10          (1 << 10) /* 00000400: Rising trigger event configuration of line 10 */
#define CH32V103_EXTI_RTENR_TR11          (1 << 11) /* 00000800: Rising trigger event configuration of line 11 */
#define CH32V103_EXTI_RTENR_TR12          (1 << 12) /* 00001000: Rising trigger event configuration of line 12 */
#define CH32V103_EXTI_RTENR_TR13          (1 << 13) /* 00002000: Rising trigger event configuration of line 13 */
#define CH32V103_EXTI_RTENR_TR14          (1 << 14) /* 00004000: Rising trigger event configuration of line 14 */
#define CH32V103_EXTI_RTENR_TR15          (1 << 15) /* 00008000: Rising trigger event configuration of line 15 */
#define CH32V103_EXTI_RTENR_TR16          (1 << 16) /* 00010000: Rising trigger event configuration of line 16 */
#define CH32V103_EXTI_RTENR_TR17          (1 << 17) /* 00020000: Rising trigger event configuration of line 17 */
#define CH32V103_EXTI_RTENR_TR18          (1 << 18) /* 00040000: Rising trigger event configuration of line 18 */
#define CH32V103_EXTI_FTENR_OFFSET        0x000c
#define CH32V103_EXTI_FTENR               (CH32V103_EXTI_BASE + CH32V103_EXTI_FTENR_OFFSET)
#define CH32V103_EXTI_FTENR_TR0           (1 <<  0) /* 00000001: Falling trigger event configuration of line 0 */
#define CH32V103_EXTI_FTENR_TR1           (1 <<  1) /* 00000002: Falling trigger event configuration of line 1 */
#define CH32V103_EXTI_FTENR_TR2           (1 <<  2) /* 00000004: Falling trigger event configuration of line 2 */
#define CH32V103_EXTI_FTENR_TR3           (1 <<  3) /* 00000008: Falling trigger event configuration of line 3 */
#define CH32V103_EXTI_FTENR_TR4           (1 <<  4) /* 00000010: Falling trigger event configuration of line 4 */
#define CH32V103_EXTI_FTENR_TR5           (1 <<  5) /* 00000020: Falling trigger event configuration of line 5 */
#define CH32V103_EXTI_FTENR_TR6           (1 <<  6) /* 00000040: Falling trigger event configuration of line 6 */
#define CH32V103_EXTI_FTENR_TR7           (1 <<  7) /* 00000080: Falling trigger event configuration of line 7 */
#define CH32V103_EXTI_FTENR_TR8           (1 <<  8) /* 00000100: Falling trigger event configuration of line 8 */
#define CH32V103_EXTI_FTENR_TR9           (1 <<  9) /* 00000200: Falling trigger event configuration of line 9 */
#define CH32V103_EXTI_FTENR_TR10          (1 << 10) /* 00000400: Falling trigger event configuration of line 10 */
#define CH32V103_EXTI_FTENR_TR11          (1 << 11) /* 00000800: Falling trigger event configuration of line 11 */
#define CH32V103_EXTI_FTENR_TR12          (1 << 12) /* 00001000: Falling trigger event configuration of line 12 */
#define CH32V103_EXTI_FTENR_TR13          (1 << 13) /* 00002000: Falling trigger event configuration of line 13 */
#define CH32V103_EXTI_FTENR_TR14          (1 << 14) /* 00004000: Falling trigger event configuration of line 14 */
#define CH32V103_EXTI_FTENR_TR15          (1 << 15) /* 00008000: Falling trigger event configuration of line 15 */
#define CH32V103_EXTI_FTENR_TR16          (1 << 16) /* 00010000: Falling trigger event configuration of line 16 */
#define CH32V103_EXTI_FTENR_TR17          (1 << 17) /* 00020000: Falling trigger event configuration of line 17 */
#define CH32V103_EXTI_FTENR_TR18          (1 << 18) /* 00040000: Falling trigger event configuration of line 18 */
#define CH32V103_EXTI_SWIEVR_OFFSET       0x0010
#define CH32V103_EXTI_SWIEVR              (CH32V103_EXTI_BASE + CH32V103_EXTI_SWIEVR_OFFSET)
#define CH32V103_EXTI_SWIEVR_SWIER0       (1 <<  0) /* 00000001: Software Interrupt on line 0 */
#define CH32V103_EXTI_SWIEVR_SWIER1       (1 <<  1) /* 00000002: Software Interrupt on line 1 */
#define CH32V103_EXTI_SWIEVR_SWIER2       (1 <<  2) /* 00000004: Software Interrupt on line 2 */
#define CH32V103_EXTI_SWIEVR_SWIER3       (1 <<  3) /* 00000008: Software Interrupt on line 3 */
#define CH32V103_EXTI_SWIEVR_SWIER4       (1 <<  4) /* 00000010: Software Interrupt on line 4 */
#define CH32V103_EXTI_SWIEVR_SWIER5       (1 <<  5) /* 00000020: Software Interrupt on line 5 */
#define CH32V103_EXTI_SWIEVR_SWIER6       (1 <<  6) /* 00000040: Software Interrupt on line 6 */
#define CH32V103_EXTI_SWIEVR_SWIER7       (1 <<  7) /* 00000080: Software Interrupt on line 7 */
#define CH32V103_EXTI_SWIEVR_SWIER8       (1 <<  8) /* 00000100: Software Interrupt on line 8 */
#define CH32V103_EXTI_SWIEVR_SWIER9       (1 <<  9) /* 00000200: Software Interrupt on line 9 */
#define CH32V103_EXTI_SWIEVR_SWIER10      (1 << 10) /* 00000400: Software Interrupt on line 10 */
#define CH32V103_EXTI_SWIEVR_SWIER11      (1 << 11) /* 00000800: Software Interrupt on line 11 */
#define CH32V103_EXTI_SWIEVR_SWIER12      (1 << 12) /* 00001000: Software Interrupt on line 12 */
#define CH32V103_EXTI_SWIEVR_SWIER13      (1 << 13) /* 00002000: Software Interrupt on line 13 */
#define CH32V103_EXTI_SWIEVR_SWIER14      (1 << 14) /* 00004000: Software Interrupt on line 14 */
#define CH32V103_EXTI_SWIEVR_SWIER15      (1 << 15) /* 00008000: Software Interrupt on line 15 */
#define CH32V103_EXTI_SWIEVR_SWIER16      (1 << 16) /* 00010000: Software Interrupt on line 16 */
#define CH32V103_EXTI_SWIEVR_SWIER17      (1 << 17) /* 00020000: Software Interrupt on line 17 */
#define CH32V103_EXTI_SWIEVR_SWIER18      (1 << 18) /* 00040000: Software Interrupt on line 18 */
#define CH32V103_EXTI_INTFR_OFFSET        0x0014
#define CH32V103_EXTI_INTFR               (CH32V103_EXTI_BASE + CH32V103_EXTI_INTFR_OFFSET)
#define CH32V103_EXTI_INTFR_PR0           (1 <<  0) /* 00000001: Pending bit 0 */
#define CH32V103_EXTI_INTFR_PR1           (1 <<  1) /* 00000002: Pending bit 1 */
#define CH32V103_EXTI_INTFR_PR2           (1 <<  2) /* 00000004: Pending bit 2 */
#define CH32V103_EXTI_INTFR_PR3           (1 <<  3) /* 00000008: Pending bit 3 */
#define CH32V103_EXTI_INTFR_PR4           (1 <<  4) /* 00000010: Pending bit 4 */
#define CH32V103_EXTI_INTFR_PR5           (1 <<  5) /* 00000020: Pending bit 5 */
#define CH32V103_EXTI_INTFR_PR6           (1 <<  6) /* 00000040: Pending bit 6 */
#define CH32V103_EXTI_INTFR_PR7           (1 <<  7) /* 00000080: Pending bit 7 */
#define CH32V103_EXTI_INTFR_PR8           (1 <<  8) /* 00000100: Pending bit 8 */
#define CH32V103_EXTI_INTFR_PR9           (1 <<  9) /* 00000200: Pending bit 9 */
#define CH32V103_EXTI_INTFR_PR10          (1 << 10) /* 00000400: Pending bit 10 */
#define CH32V103_EXTI_INTFR_PR11          (1 << 11) /* 00000800: Pending bit 11 */
#define CH32V103_EXTI_INTFR_PR12          (1 << 12) /* 00001000: Pending bit 12 */
#define CH32V103_EXTI_INTFR_PR13          (1 << 13) /* 00002000: Pending bit 13 */
#define CH32V103_EXTI_INTFR_PR14          (1 << 14) /* 00004000: Pending bit 14 */
#define CH32V103_EXTI_INTFR_PR15          (1 << 15) /* 00008000: Pending bit 15 */
#define CH32V103_EXTI_INTFR_PR16          (1 << 16) /* 00010000: Pending bit 16 */
#define CH32V103_EXTI_INTFR_PR17          (1 << 17) /* 00020000: Pending bit 17 */
#define CH32V103_EXTI_INTFR_PR18          (1 << 18) /* 00040000: Pending bit 18 */

