robertlipe/svdtoheaders/demo/h/ch32v103_reg.h
/* RTC - Real time clock */
#define CH32V103_RTC_BASE                 0x40002800
#define CH32V103_RTC_CTLRH_OFFSET         0x0000
#define CH32V103_RTC_CTLRH                (CH32V103_RTC_BASE + CH32V103_RTC_CTLRH_OFFSET)
#define CH32V103_RTC_CTLRH_SECIE          (1 <<  0) /* 00000001: Second interrupt Enable */
#define CH32V103_RTC_CTLRH_ALRIE          (1 <<  1) /* 00000002: Alarm interrupt Enable */
#define CH32V103_RTC_CTLRH_OWIE           (1 <<  2) /* 00000004: Overflow interrupt Enable */
#define CH32V103_RTC_CTLRL_OFFSET         0x0004
#define CH32V103_RTC_CTLRL                (CH32V103_RTC_BASE + CH32V103_RTC_CTLRL_OFFSET)
#define CH32V103_RTC_CTLRL_SECF           (1 <<  0) /* 00000001: Second Flag */
#define CH32V103_RTC_CTLRL_ALRF           (1 <<  1) /* 00000002: Alarm Flag */
#define CH32V103_RTC_CTLRL_OWF            (1 <<  2) /* 00000004: Overflow Flag */
#define CH32V103_RTC_CTLRL_RSF            (1 <<  3) /* 00000008: Registers Synchronized Flag */
#define CH32V103_RTC_CTLRL_CNF            (1 <<  4) /* 00000010: Configuration Flag */
#define CH32V103_RTC_CTLRL_RTOFF          (1 <<  5) /* 00000020: RTC operation OFF */
#define CH32V103_RTC_PSCRH_OFFSET         0x0008
#define CH32V103_RTC_PSCRH                (CH32V103_RTC_BASE + CH32V103_RTC_PSCRH_OFFSET)
#define CH32V103_RTC_PSCRH_PRLH           (0xf << 0) /* 0000000f: RTC Prescaler Load Register High */
#define CH32V103_RTC_PSCRH_PRLH_MASK      (0xf << 0)
#define CH32V103_RTC_PSCRL_OFFSET         0x000c
#define CH32V103_RTC_PSCRL                (CH32V103_RTC_BASE + CH32V103_RTC_PSCRL_OFFSET)
#define CH32V103_RTC_PSCRL_PRLL           (0xffff << 0) /* 0000ffff: RTC Prescaler Divider Register Low */
#define CH32V103_RTC_PSCRL_PRLL_MASK      (0xffff << 0)
#define CH32V103_RTC_DIVH_OFFSET          0x0010
#define CH32V103_RTC_DIVH                 (CH32V103_RTC_BASE + CH32V103_RTC_DIVH_OFFSET)
#define CH32V103_RTC_DIVH_DIVH            (0xf << 0) /* 0000000f: RTC prescaler divider register high */
#define CH32V103_RTC_DIVH_DIVH_MASK       (0xf << 0)
#define CH32V103_RTC_DIVL_OFFSET          0x0014
#define CH32V103_RTC_DIVL                 (CH32V103_RTC_BASE + CH32V103_RTC_DIVL_OFFSET)
#define CH32V103_RTC_DIVL_DIVL            (0xffff << 0) /* 0000ffff: RTC prescaler divider register Low */
#define CH32V103_RTC_DIVL_DIVL_MASK       (0xffff << 0)
#define CH32V103_RTC_CNTH_OFFSET          0x0018
#define CH32V103_RTC_CNTH                 (CH32V103_RTC_BASE + CH32V103_RTC_CNTH_OFFSET)
#define CH32V103_RTC_CNTH_CNTH            (0xffff << 0) /* 0000ffff: RTC counter register high */
#define CH32V103_RTC_CNTH_CNTH_MASK       (0xffff << 0)
#define CH32V103_RTC_CNTL_OFFSET          0x001c
#define CH32V103_RTC_CNTL                 (CH32V103_RTC_BASE + CH32V103_RTC_CNTL_OFFSET)
#define CH32V103_RTC_CNTL_CNTL            (0xffff << 0) /* 0000ffff: RTC counter register Low */
#define CH32V103_RTC_CNTL_CNTL_MASK       (0xffff << 0)
#define CH32V103_RTC_ALRMH_OFFSET         0x0020
#define CH32V103_RTC_ALRMH                (CH32V103_RTC_BASE + CH32V103_RTC_ALRMH_OFFSET)
#define CH32V103_RTC_ALRMH_ALRMH          (0xffff << 0) /* 0000ffff: RTC alarm register high */
#define CH32V103_RTC_ALRMH_ALRMH_MASK     (0xffff << 0)
#define CH32V103_RTC_ALRML_OFFSET         0x0024
#define CH32V103_RTC_ALRML                (CH32V103_RTC_BASE + CH32V103_RTC_ALRML_OFFSET)
#define CH32V103_RTC_ALRML_ALRML          (0xffff << 0) /* 0000ffff: RTC alarm register low */
#define CH32V103_RTC_ALRML_ALRML_MASK     (0xffff << 0)

/* BKP - Backup registers */
#define CH32V103_BKP_BASE                 0x40006c00
#define CH32V103_BKP_DATAR1_OFFSET        0x0004
#define CH32V103_BKP_DATAR1               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR1_OFFSET)
#define CH32V103_BKP_DATAR1_D1            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR1_D1_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR2_OFFSET        0x0008
#define CH32V103_BKP_DATAR2               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR2_OFFSET)
#define CH32V103_BKP_DATAR2_D2            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR2_D2_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR3_OFFSET        0x000c
#define CH32V103_BKP_DATAR3               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR3_OFFSET)
#define CH32V103_BKP_DATAR3_D3            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR3_D3_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR4_OFFSET        0x0010
#define CH32V103_BKP_DATAR4               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR4_OFFSET)
#define CH32V103_BKP_DATAR4_D4            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR4_D4_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR5_OFFSET        0x0014
#define CH32V103_BKP_DATAR5               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR5_OFFSET)
#define CH32V103_BKP_DATAR5_D5            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR5_D5_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR6_OFFSET        0x0018
#define CH32V103_BKP_DATAR6               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR6_OFFSET)
#define CH32V103_BKP_DATAR6_D6            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR6_D6_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR7_OFFSET        0x001c
#define CH32V103_BKP_DATAR7               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR7_OFFSET)
#define CH32V103_BKP_DATAR7_D7            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR7_D7_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR8_OFFSET        0x0020
#define CH32V103_BKP_DATAR8               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR8_OFFSET)
#define CH32V103_BKP_DATAR8_D8            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR8_D8_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR9_OFFSET        0x0024
#define CH32V103_BKP_DATAR9               (CH32V103_BKP_BASE + CH32V103_BKP_DATAR9_OFFSET)
#define CH32V103_BKP_DATAR9_D9            (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR9_D9_MASK       (0xffff << 0)
#define CH32V103_BKP_DATAR10_OFFSET       0x0028
#define CH32V103_BKP_DATAR10              (CH32V103_BKP_BASE + CH32V103_BKP_DATAR10_OFFSET)
#define CH32V103_BKP_DATAR10_D10          (0xffff << 0) /* 0000ffff: Backup data */
#define CH32V103_BKP_DATAR10_D10_MASK     (0xffff << 0)
#define CH32V103_BKP_OCTLR_OFFSET         0x002c
#define CH32V103_BKP_OCTLR                (CH32V103_BKP_BASE + CH32V103_BKP_OCTLR_OFFSET)
#define CH32V103_BKP_OCTLR_CAL            (0x7f << 0) /* 0000007f: Calibration value */
#define CH32V103_BKP_OCTLR_CAL_MASK       (0x7f << 0)
#define CH32V103_BKP_OCTLR_CCO            (1 <<  7) /* 00000080: Calibration Clock Output */
#define CH32V103_BKP_OCTLR_ASOE           (1 <<  8) /* 00000100: Alarm or second output enable */
#define CH32V103_BKP_OCTLR_ASOS           (1 <<  9) /* 00000200: Alarm or second output selection */
#define CH32V103_BKP_TPCTLR_OFFSET        0x0030
#define CH32V103_BKP_TPCTLR               (CH32V103_BKP_BASE + CH32V103_BKP_TPCTLR_OFFSET)
#define CH32V103_BKP_TPCTLR_TPE           (1 <<  0) /* 00000001: Tamper pin enable */
#define CH32V103_BKP_TPCTLR_TPAL          (1 <<  1) /* 00000002: Tamper pin active level */
#define CH32V103_BKP_TPCSR_OFFSET         0x0034
#define CH32V103_BKP_TPCSR                (CH32V103_BKP_BASE + CH32V103_BKP_TPCSR_OFFSET)
#define CH32V103_BKP_TPCSR_CTE            (1 <<  0) /* 00000001: Clear Tamper event */
#define CH32V103_BKP_TPCSR_CTI            (1 <<  1) /* 00000002: Clear Tamper Interrupt */
#define CH32V103_BKP_TPCSR_TPIE           (1 <<  2) /* 00000004: Tamper Pin interrupt enable */
#define CH32V103_BKP_TPCSR_TEF            (1 <<  8) /* 00000100: Tamper Event Flag */
#define CH32V103_BKP_TPCSR_TIF            (1 <<  9) /* 00000200: Tamper Interrupt Flag */

/* IWDG - Independent watchdog */
#define CH32V103_IWDG_BASE                0x40003000
#define CH32V103_IWDG_CTLR_OFFSET         0x0000
#define CH32V103_IWDG_CTLR                (CH32V103_IWDG_BASE + CH32V103_IWDG_CTLR_OFFSET)
#define CH32V103_IWDG_CTLR_KEY            (0xffff << 0) /* 0000ffff: Key value */
#define CH32V103_IWDG_CTLR_KEY_MASK       (0xffff << 0)
#define CH32V103_IWDG_PSCR_OFFSET         0x0004
#define CH32V103_IWDG_PSCR                (CH32V103_IWDG_BASE + CH32V103_IWDG_PSCR_OFFSET)
#define CH32V103_IWDG_PSCR_PR             (0x7 << 0) /* 00000007: Prescaler divider */
#define CH32V103_IWDG_PSCR_PR_MASK        (0x7 << 0)
#define CH32V103_IWDG_RLDR_OFFSET         0x0008
#define CH32V103_IWDG_RLDR                (CH32V103_IWDG_BASE + CH32V103_IWDG_RLDR_OFFSET)
#define CH32V103_IWDG_RLDR_RL             (0xfff << 0) /* 00000fff: Watchdog counter reload value */
#define CH32V103_IWDG_RLDR_RL_MASK        (0xfff << 0)
#define CH32V103_IWDG_STATR_OFFSET        0x000c
#define CH32V103_IWDG_STATR               (CH32V103_IWDG_BASE + CH32V103_IWDG_STATR_OFFSET)
#define CH32V103_IWDG_STATR_PVU           (1 <<  0) /* 00000001: Watchdog prescaler value update */
#define CH32V103_IWDG_STATR_RVU           (1 <<  1) /* 00000002: Watchdog counter reload value update */

/* WWDG - Window watchdog */
#define CH32V103_WWDG_BASE                0x40002c00
#define CH32V103_WWDG_CTLR_OFFSET         0x0000
#define CH32V103_WWDG_CTLR                (CH32V103_WWDG_BASE + CH32V103_WWDG_CTLR_OFFSET)
#define CH32V103_WWDG_CTLR_T              (0x7f << 0) /* 0000007f: 7-bit counter (MSB to LSB) */
#define CH32V103_WWDG_CTLR_T_MASK         (0x7f << 0)
#define CH32V103_WWDG_CTLR_WDGA           (1 <<  7) /* 00000080: Activation bit */
#define CH32V103_WWDG_CFGR_OFFSET         0x0004
#define CH32V103_WWDG_CFGR                (CH32V103_WWDG_BASE + CH32V103_WWDG_CFGR_OFFSET)
#define CH32V103_WWDG_CFGR_W              (0x7f << 0) /* 0000007f: 7-bit window value */
#define CH32V103_WWDG_CFGR_W_MASK         (0x7f << 0)
#define CH32V103_WWDG_CFGR_WDGTB          (0x3 << 7) /* 00000180: Timer Base */
#define CH32V103_WWDG_CFGR_WDGTB_MASK     (0x3 << 7)
#define CH32V103_WWDG_CFGR_EWI            (1 <<  9) /* 00000200: Early Wakeup Interrupt */
#define CH32V103_WWDG_STATR_OFFSET        0x0008
#define CH32V103_WWDG_STATR               (CH32V103_WWDG_BASE + CH32V103_WWDG_STATR_OFFSET)
#define CH32V103_WWDG_STATR_WEIF          (1 <<  0) /* 00000001: Early Wakeup Interrupt Flag */

