robertlipe/svdtoheaders/demo/h/ch32v103_reg.h
/* DAC1 - Digital to analog converter */
#define CH32V103_DAC1_BASE                0x40007400
#define CH32V103_DAC1_CTLR_OFFSET         0x0000
#define CH32V103_DAC1_CTLR                (CH32V103_DAC1_BASE + CH32V103_DAC1_CTLR_OFFSET)
#define CH32V103_DAC1_CTLR_EN1            (1 <<  0) /* 00000001: DAC channel1 enable */
#define CH32V103_DAC1_CTLR_BOFF1          (1 <<  1) /* 00000002: DAC channel1 output buffer disable */
#define CH32V103_DAC1_CTLR_TEN1           (1 <<  2) /* 00000004: DAC channel1 trigger enable */
#define CH32V103_DAC1_CTLR_TSEL1          (0x7 << 3) /* 00000038: DAC channel1 trigger selection */
#define CH32V103_DAC1_CTLR_TSEL1_MASK     (0x7 << 3)
#define CH32V103_DAC1_CTLR_WAVE1          (0x3 << 6) /* 000000c0: DAC channel1 noise/triangle wave generation enable */
#define CH32V103_DAC1_CTLR_WAVE1_MASK     (0x3 << 6)
#define CH32V103_DAC1_CTLR_MAMP1          (0xf << 8) /* 00000f00: DAC channel1 mask/amplitude selector */
#define CH32V103_DAC1_CTLR_MAMP1_MASK     (0xf << 8)
#define CH32V103_DAC1_CTLR_DMAEN1         (1 << 12) /* 00001000: DAC channel1 DMA enable */
#define CH32V103_DAC1_CTLR_EN2            (1 << 16) /* 00010000: DAC channel2 enable */
#define CH32V103_DAC1_CTLR_BOFF2          (1 << 17) /* 00020000: DAC channel2 output buffer disable */
#define CH32V103_DAC1_CTLR_TEN2           (1 << 18) /* 00040000: DAC channel2 trigger enable */
#define CH32V103_DAC1_CTLR_TSEL2          (0x7 << 19) /* 00380000: DAC channel2 trigger selection */
#define CH32V103_DAC1_CTLR_TSEL2_MASK     (0x7 << 19)
#define CH32V103_DAC1_CTLR_WAVE2          (0x3 << 22) /* 00c00000: DAC channel2 noise/triangle wave generation enable */
#define CH32V103_DAC1_CTLR_WAVE2_MASK     (0x3 << 22)
#define CH32V103_DAC1_CTLR_MAMP2          (0xf << 24) /* 0f000000: DAC channel2 mask/amplitude selector */
#define CH32V103_DAC1_CTLR_MAMP2_MASK     (0xf << 24)
#define CH32V103_DAC1_CTLR_DMAEN2         (1 << 28) /* 10000000: DAC channel2 DMA enable */
#define CH32V103_DAC1_SWTR_OFFSET         0x0004
#define CH32V103_DAC1_SWTR                (CH32V103_DAC1_BASE + CH32V103_DAC1_SWTR_OFFSET)
#define CH32V103_DAC1_SWTR_SWTRIG1        (1 <<  0) /* 00000001: DAC channel1 software trigger */
#define CH32V103_DAC1_SWTR_SWTRIG2        (1 <<  1) /* 00000002: DAC channel2 software trigger */
#define CH32V103_DAC1_R12BDHR1_OFFSET     0x0008
#define CH32V103_DAC1_R12BDHR1            (CH32V103_DAC1_BASE + CH32V103_DAC1_R12BDHR1_OFFSET)
#define CH32V103_DAC1_R12BDHR1_DACC1DHR   (0xfff << 0) /* 00000fff: DAC channel1 12-bit right-aligned data */
#define CH32V103_DAC1_R12BDHR1_DACC1DHR_MASK (0xfff << 0)
#define CH32V103_DAC1_L12BDHR1_OFFSET     0x000c
#define CH32V103_DAC1_L12BDHR1            (CH32V103_DAC1_BASE + CH32V103_DAC1_L12BDHR1_OFFSET)
#define CH32V103_DAC1_L12BDHR1_DACC1DHR   (0xfff << 4) /* 0000fff0: DAC channel1 12-bit left-aligned data */
#define CH32V103_DAC1_L12BDHR1_DACC1DHR_MASK (0xfff << 4)
#define CH32V103_DAC1_R12BDHR2_OFFSET     0x0014
#define CH32V103_DAC1_R12BDHR2            (CH32V103_DAC1_BASE + CH32V103_DAC1_R12BDHR2_OFFSET)
#define CH32V103_DAC1_R12BDHR2_DACC2DHR   (0xfff << 0) /* 00000fff: DAC channel2 12-bit right-aligned data */
#define CH32V103_DAC1_R12BDHR2_DACC2DHR_MASK (0xfff << 0)
#define CH32V103_DAC1_L12BDHR2_OFFSET     0x0018
#define CH32V103_DAC1_L12BDHR2            (CH32V103_DAC1_BASE + CH32V103_DAC1_L12BDHR2_OFFSET)
#define CH32V103_DAC1_L12BDHR2_DACC2DHR   (0xfff << 4) /* 0000fff0: DAC channel2 12-bit left-aligned data */
#define CH32V103_DAC1_L12BDHR2_DACC2DHR_MASK (0xfff << 4)
#define CH32V103_DAC1_DOR1_OFFSET         0x002c
#define CH32V103_DAC1_DOR1                (CH32V103_DAC1_BASE + CH32V103_DAC1_DOR1_OFFSET)
#define CH32V103_DAC1_DOR1_DACC1DOR       (0xfff << 0) /* 00000fff: DAC channel1 data output */
#define CH32V103_DAC1_DOR1_DACC1DOR_MASK  (0xfff << 0)
#define CH32V103_DAC1_DOR2_OFFSET         0x0030
#define CH32V103_DAC1_DOR2                (CH32V103_DAC1_BASE + CH32V103_DAC1_DOR2_OFFSET)
#define CH32V103_DAC1_DOR2_DACC2DOR       (0xfff << 0) /* 00000fff: DAC channel2 data output */
#define CH32V103_DAC1_DOR2_DACC2DOR_MASK  (0xfff << 0)

/* DBG - Debug support */
#define CH32V103_DBG_BASE                 0xe0042000
#define CH32V103_DBG_IDCODE_OFFSET        0x0000
#define CH32V103_DBG_IDCODE               (CH32V103_DBG_BASE + CH32V103_DBG_IDCODE_OFFSET)
#define CH32V103_DBG_IDCODE_DEV_ID        (0xfff << 0) /* 00000fff: DEV_ID */
#define CH32V103_DBG_IDCODE_DEV_ID_MASK   (0xfff << 0)
#define CH32V103_DBG_IDCODE_REV_ID        (0xffff << 16) /* ffff0000: REV_ID */
#define CH32V103_DBG_IDCODE_REV_ID_MASK   (0xffff << 16)
#define CH32V103_DBG_CFGR_OFFSET          0x0004
#define CH32V103_DBG_CFGR                 (CH32V103_DBG_BASE + CH32V103_DBG_CFGR_OFFSET)
#define CH32V103_DBG_CFGR_DBG_SLEEP       (1 <<  0) /* 00000001: DBG_SLEEP */
#define CH32V103_DBG_CFGR_DBG_STOP        (1 <<  1) /* 00000002: DBG_STOP */
#define CH32V103_DBG_CFGR_DBG_STANDBY     (1 <<  2) /* 00000004: DBG_STANDBY */
#define CH32V103_DBG_CFGR_TRACE_IOEN      (1 <<  5) /* 00000020: TRACE_IOEN */
#define CH32V103_DBG_CFGR_TRACE_MODE      (0x3 << 6) /* 000000c0: TRACE_MODE */
#define CH32V103_DBG_CFGR_TRACE_MODE_MASK (0x3 << 6)
#define CH32V103_DBG_CFGR_DBG_IWDG_STOP   (1 <<  8) /* 00000100: DBG_IWDG_STOP */
#define CH32V103_DBG_CFGR_DBG_WWDG_STOP   (1 <<  9) /* 00000200: DBG_WWDG_STOP */
#define CH32V103_DBG_CFGR_DBG_TIM1_STOP   (1 << 10) /* 00000400: DBG_TIM1_STOP */
#define CH32V103_DBG_CFGR_DBG_TIM2_STOP   (1 << 11) /* 00000800: DBG_TIM2_STOP */
#define CH32V103_DBG_CFGR_DBG_TIM3_STOP   (1 << 12) /* 00001000: DBG_TIM3_STOP */
#define CH32V103_DBG_CFGR_DBG_TIM4_STOP   (1 << 13) /* 00002000: DBG_TIM4_STOP */
#define CH32V103_DBG_CFGR_DBG_CAN1_STOP   (1 << 14) /* 00004000: DBG_CAN1_STOP */
#define CH32V103_DBG_CFGR_DBG_I2C1_SMBUS_TIMEOUT (1 << 15) /* 00008000: DBG_I2C1_SMBUS_TIMEOUT */
#define CH32V103_DBG_CFGR_DBG_I2C2_SMBUS_TIMEOUT (1 << 16) /* 00010000: DBG_I2C2_SMBUS_TIMEOUT */
#define CH32V103_DBG_CFGR_DBG_TIM8_STOP   (1 << 17) /* 00020000: DBG_TIM8_STOP */
#define CH32V103_DBG_CFGR_DBG_TIM5_STOP   (1 << 18) /* 00040000: DBG_TIM5_STOP */
#define CH32V103_DBG_CFGR_DBG_TIM6_STOP   (1 << 19) /* 00080000: DBG_TIM6_STOP */
#define CH32V103_DBG_CFGR_DBG_TIM7_STOP   (1 << 20) /* 00100000: DBG_TIM7_STOP */
#define CH32V103_DBG_CFGR_DBG_CAN2_STOP   (1 << 21) /* 00200000: DBG_CAN2_STOP */

/* USBHD - USB register */
#define CH32V103_USBHD_BASE               0x40023400
#define CH32V103_USBHD_R8_USB_CTRL_OFFSET 0x0000
#define CH32V103_USBHD_R8_USB_CTRL        (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_CTRL_OFFSET)
#define CH32V103_USBHD_R8_UDEV_CTRL__R8_UHOST_CTRL_OFFSET 0x0001
#define CH32V103_USBHD_R8_UDEV_CTRL__R8_UHOST_CTRL (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UDEV_CTRL__R8_UHOST_CTRL_OFFSET)
#define CH32V103_USBHD_R8_USB_INT_EN_OFFSET 0x0002
#define CH32V103_USBHD_R8_USB_INT_EN      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_INT_EN_OFFSET)
#define CH32V103_USBHD_R8_USB_DEV_AD_OFFSET 0x0003
#define CH32V103_USBHD_R8_USB_DEV_AD      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_DEV_AD_OFFSET)
#define CH32V103_USBHD_R8_USB_MIS_ST_OFFSET 0x0005
#define CH32V103_USBHD_R8_USB_MIS_ST      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_MIS_ST_OFFSET)
#define CH32V103_USBHD_R8_USB_INT_FG_OFFSET 0x0006
#define CH32V103_USBHD_R8_USB_INT_FG      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_INT_FG_OFFSET)
#define CH32V103_USBHD_R8_USB_INT_ST_OFFSET 0x0007
#define CH32V103_USBHD_R8_USB_INT_ST      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_INT_ST_OFFSET)
#define CH32V103_USBHD_R8_USB_RX_LEN_OFFSET 0x0008
#define CH32V103_USBHD_R8_USB_RX_LEN      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_RX_LEN_OFFSET)
#define CH32V103_USBHD_R8_UEP4_1_MOD_OFFSET 0x000c
#define CH32V103_USBHD_R8_UEP4_1_MOD      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP4_1_MOD_OFFSET)
#define CH32V103_USBHD_R8_UEP2_3_MOD__R8_UH_EP_MOD_OFFSET 0x000d
#define CH32V103_USBHD_R8_UEP2_3_MOD__R8_UH_EP_MOD (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP2_3_MOD__R8_UH_EP_MOD_OFFSET)
#define CH32V103_USBHD_R16_UEP0_DMA_OFFSET 0x0010
#define CH32V103_USBHD_R16_UEP0_DMA       (CH32V103_USBHD_BASE + CH32V103_USBHD_R16_UEP0_DMA_OFFSET)
#define CH32V103_USBHD_R16_UEP1_DMA_OFFSET 0x0014
#define CH32V103_USBHD_R16_UEP1_DMA       (CH32V103_USBHD_BASE + CH32V103_USBHD_R16_UEP1_DMA_OFFSET)
#define CH32V103_USBHD_R16_UEP2_DMA__R16_UH_RX_DMA_OFFSET 0x0018
#define CH32V103_USBHD_R16_UEP2_DMA__R16_UH_RX_DMA (CH32V103_USBHD_BASE + CH32V103_USBHD_R16_UEP2_DMA__R16_UH_RX_DMA_OFFSET)
#define CH32V103_USBHD_R16_UEP3_DMA__R16_UH_TX_DMA_OFFSET 0x001c
#define CH32V103_USBHD_R16_UEP3_DMA__R16_UH_TX_DMA (CH32V103_USBHD_BASE + CH32V103_USBHD_R16_UEP3_DMA__R16_UH_TX_DMA_OFFSET)
#define CH32V103_USBHD_R8_UEP0_T_LEN_OFFSET 0x0020
#define CH32V103_USBHD_R8_UEP0_T_LEN      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP0_T_LEN_OFFSET)
#define CH32V103_USBHD_R8_UEP0_CTRL_OFFSET 0x0022
#define CH32V103_USBHD_R8_UEP0_CTRL       (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP0_CTRL_OFFSET)
#define CH32V103_USBHD_R8_UEP1_T_LEN_OFFSET 0x0024
#define CH32V103_USBHD_R8_UEP1_T_LEN      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP1_T_LEN_OFFSET)
#define CH32V103_USBHD_R8_UEP1_CTRL__R8_UH_SETUP_OFFSET 0x0026
#define CH32V103_USBHD_R8_UEP1_CTRL__R8_UH_SETUP (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP1_CTRL__R8_UH_SETUP_OFFSET)
#define CH32V103_USBHD_R8_UEP2_T_LEN__R8_UH_EP_PID_OFFSET 0x0028
#define CH32V103_USBHD_R8_UEP2_T_LEN__R8_UH_EP_PID (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP2_T_LEN__R8_UH_EP_PID_OFFSET)
#define CH32V103_USBHD_R8_UEP2_CTRL__R8_UH_RX_CTRL_OFFSET 0x002a
#define CH32V103_USBHD_R8_UEP2_CTRL__R8_UH_RX_CTRL (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP2_CTRL__R8_UH_RX_CTRL_OFFSET)
#define CH32V103_USBHD_R8_UEP3_T_LEN__R8_UH_TX_LEN_OFFSET 0x002c
#define CH32V103_USBHD_R8_UEP3_T_LEN__R8_UH_TX_LEN (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP3_T_LEN__R8_UH_TX_LEN_OFFSET)
#define CH32V103_USBHD_R8_UEP3_CTRL__R8_UH_TX_CTRL_OFFSET 0x002e
#define CH32V103_USBHD_R8_UEP3_CTRL__R8_UH_TX_CTRL (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP3_CTRL__R8_UH_TX_CTRL_OFFSET)
#define CH32V103_USBHD_R8_UEP4_T_LEN_OFFSET 0x0030
#define CH32V103_USBHD_R8_UEP4_T_LEN      (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP4_T_LEN_OFFSET)
#define CH32V103_USBHD_R8_UEP4_CTRL_OFFSET 0x0032
#define CH32V103_USBHD_R8_UEP4_CTRL       (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_UEP4_CTRL_OFFSET)
#define CH32V103_USBHD_R8_USB_TYPE_C_CTRL_OFFSET 0x0038
#define CH32V103_USBHD_R8_USB_TYPE_C_CTRL (CH32V103_USBHD_BASE + CH32V103_USBHD_R8_USB_TYPE_C_CTRL_OFFSET)

