robertlipe/svdtoheaders/demo/h/ch32v103_reg.h
/* CRC - CRC calculation unit */
#define CH32V103_CRC_BASE                 0x40023000
#define CH32V103_CRC_DATAR_OFFSET         0x0000
#define CH32V103_CRC_DATAR                (CH32V103_CRC_BASE + CH32V103_CRC_DATAR_OFFSET)
#define CH32V103_CRC_DATAR_DATA           (0xffffffff << 0) /* ffffffff: Data Register */
#define CH32V103_CRC_DATAR_DATA_MASK      (0xffffffff << 0)
#define CH32V103_CRC_IDATAR_OFFSET        0x0004
#define CH32V103_CRC_IDATAR               (CH32V103_CRC_BASE + CH32V103_CRC_IDATAR_OFFSET)
#define CH32V103_CRC_IDATAR_IDATA         (0xff << 0) /* 000000ff: Independent Data register */
#define CH32V103_CRC_IDATAR_IDATA_MASK    (0xff << 0)
#define CH32V103_CRC_CTLR_OFFSET          0x0008
#define CH32V103_CRC_CTLR                 (CH32V103_CRC_BASE + CH32V103_CRC_CTLR_OFFSET)
#define CH32V103_CRC_CTLR_RST             (1 <<  0) /* 00000001: Reset bit */

/* FLASH - FLASH */
#define CH32V103_FLASH_BASE               0x40022000
#define CH32V103_FLASH_ACTLR_OFFSET       0x0000
#define CH32V103_FLASH_ACTLR              (CH32V103_FLASH_BASE + CH32V103_FLASH_ACTLR_OFFSET)
#define CH32V103_FLASH_ACTLR_LATENCY      (0x7 << 0) /* 00000007: Latency */
#define CH32V103_FLASH_ACTLR_LATENCY_MASK (0x7 << 0)
#define CH32V103_FLASH_ACTLR_PRFTBE       (1 <<  4) /* 00000010: Prefetch buffer enable */
#define CH32V103_FLASH_ACTLR_PRFTBS       (1 <<  5) /* 00000020: Prefetch buffer status */
#define CH32V103_FLASH_KEYR_OFFSET        0x0004
#define CH32V103_FLASH_KEYR               (CH32V103_FLASH_BASE + CH32V103_FLASH_KEYR_OFFSET)
#define CH32V103_FLASH_KEYR_KEYR          (0xffffffff << 0) /* ffffffff: FPEC key */
#define CH32V103_FLASH_KEYR_KEYR_MASK     (0xffffffff << 0)
#define CH32V103_FLASH_OBKEYR_OFFSET      0x0008
#define CH32V103_FLASH_OBKEYR             (CH32V103_FLASH_BASE + CH32V103_FLASH_OBKEYR_OFFSET)
#define CH32V103_FLASH_OBKEYR_OBKEYR      (0xffffffff << 0) /* ffffffff: Option byte key */
#define CH32V103_FLASH_OBKEYR_OBKEYR_MASK (0xffffffff << 0)
#define CH32V103_FLASH_STATR_OFFSET       0x000c
#define CH32V103_FLASH_STATR              (CH32V103_FLASH_BASE + CH32V103_FLASH_STATR_OFFSET)
#define CH32V103_FLASH_STATR_EOP          (1 <<  5) /* 00000020: End of operation */
#define CH32V103_FLASH_STATR_WRPRTERR     (1 <<  4) /* 00000010: Write protection error */
#define CH32V103_FLASH_STATR_PGERR        (1 <<  2) /* 00000004: Programming error */
#define CH32V103_FLASH_STATR_BSY          (1 <<  0) /* 00000001: Busy */
#define CH32V103_FLASH_CTLR_OFFSET        0x0010
#define CH32V103_FLASH_CTLR               (CH32V103_FLASH_BASE + CH32V103_FLASH_CTLR_OFFSET)
#define CH32V103_FLASH_CTLR_PG            (1 <<  0) /* 00000001: Programming */
#define CH32V103_FLASH_CTLR_PER           (1 <<  1) /* 00000002: Page Erase */
#define CH32V103_FLASH_CTLR_MER           (1 <<  2) /* 00000004: Mass Erase */
#define CH32V103_FLASH_CTLR_OBPG          (1 <<  4) /* 00000010: Option byte programming */
#define CH32V103_FLASH_CTLR_OBER          (1 <<  5) /* 00000020: Option byte erase */
#define CH32V103_FLASH_CTLR_STRT          (1 <<  6) /* 00000040: Start */
#define CH32V103_FLASH_CTLR_LOCK          (1 <<  7) /* 00000080: Lock */
#define CH32V103_FLASH_CTLR_OBWRE         (1 <<  9) /* 00000200: Option bytes write enable */
#define CH32V103_FLASH_CTLR_ERRIE         (1 << 10) /* 00000400: Error interrupt enable */
#define CH32V103_FLASH_CTLR_EOPIE         (1 << 12) /* 00001000: End of operation interrupt enable */
#define CH32V103_FLASH_CTLR_FLOCK         (1 << 15) /* 00008000: FAST programming lock */
#define CH32V103_FLASH_CTLR_FTPG          (1 << 16) /* 00010000: execute fast programming */
#define CH32V103_FLASH_CTLR_FTER          (1 << 17) /* 00020000: execute fast 128byte erase */
#define CH32V103_FLASH_CTLR_BUFLOAD       (1 << 18) /* 00040000: execute data load inner buffer */
#define CH32V103_FLASH_CTLR_BUFRST        (1 << 19) /* 00080000: execute inner buffer reset */
#define CH32V103_FLASH_ADDR_OFFSET        0x0014
#define CH32V103_FLASH_ADDR               (CH32V103_FLASH_BASE + CH32V103_FLASH_ADDR_OFFSET)
#define CH32V103_FLASH_ADDR_FAR           (0xffffffff << 0) /* ffffffff: Flash Address */
#define CH32V103_FLASH_ADDR_FAR_MASK      (0xffffffff << 0)
#define CH32V103_FLASH_OBR_OFFSET         0x001c
#define CH32V103_FLASH_OBR                (CH32V103_FLASH_BASE + CH32V103_FLASH_OBR_OFFSET)
#define CH32V103_FLASH_OBR_OPTERR         (1 <<  0) /* 00000001: Option byte error */
#define CH32V103_FLASH_OBR_RDPRT          (1 <<  1) /* 00000002: Read protection */
#define CH32V103_FLASH_OBR_IWDG_SW        (1 <<  2) /* 00000004: IWDG_SW */
#define CH32V103_FLASH_OBR_nRST_STOP      (1 <<  3) /* 00000008: nRST_STOP */
#define CH32V103_FLASH_OBR_nRST_STDBY     (1 <<  4) /* 00000010: nRST_STDBY */
#define CH32V103_FLASH_OBR_USBD_MODE      (1 <<  5) /* 00000020: USBD compatible speed mode configure */
#define CH32V103_FLASH_OBR_USBD_PU        (1 <<  6) /* 00000040: USBD compatible inner pull up resistance configure */
#define CH32V103_FLASH_OBR_POR_CTR        (1 <<  7) /* 00000080: Power on reset time */
#define CH32V103_FLASH_OBR_Data0          (0xff << 10) /* 0003fc00: Data0 */
#define CH32V103_FLASH_OBR_Data0_MASK     (0xff << 10)
#define CH32V103_FLASH_OBR_Data1          (0xff << 18) /* 03fc0000: Data1 */
#define CH32V103_FLASH_OBR_Data1_MASK     (0xff << 18)
#define CH32V103_FLASH_WPR_OFFSET         0x0020
#define CH32V103_FLASH_WPR                (CH32V103_FLASH_BASE + CH32V103_FLASH_WPR_OFFSET)
#define CH32V103_FLASH_WPR_WRP            (0xffffffff << 0) /* ffffffff: Write protect */
#define CH32V103_FLASH_WPR_WRP_MASK       (0xffffffff << 0)
#define CH32V103_FLASH_MODEKEYR_OFFSET    0x0024
#define CH32V103_FLASH_MODEKEYR           (CH32V103_FLASH_BASE + CH32V103_FLASH_MODEKEYR_OFFSET)
#define CH32V103_FLASH_MODEKEYR_MODEKEYR  (0xffffffff << 0) /* ffffffff: high speed write /erase mode ENABLE */
#define CH32V103_FLASH_MODEKEYR_MODEKEYR_MASK (0xffffffff << 0)

/* PFIC - Programmable Fast Interrupt Controller */
#define CH32V103_PFIC_BASE                0xe000e000
#define CH32V103_PFIC_ISR1_OFFSET         0x0000
#define CH32V103_PFIC_ISR1                (CH32V103_PFIC_BASE + CH32V103_PFIC_ISR1_OFFSET)
#define CH32V103_PFIC_ISR1_INTENSTA2_3    (0x3 << 2) /* 0000000c: Interrupt ID Status */
#define CH32V103_PFIC_ISR1_INTENSTA2_3_MASK (0x3 << 2)
#define CH32V103_PFIC_ISR1_INTENSTA12_31  (0xfffff << 12) /* fffff000: Interrupt ID Status */
#define CH32V103_PFIC_ISR1_INTENSTA12_31_MASK (0xfffff << 12)
#define CH32V103_PFIC_ISR2_OFFSET         0x0004
#define CH32V103_PFIC_ISR2                (CH32V103_PFIC_BASE + CH32V103_PFIC_ISR2_OFFSET)
#define CH32V103_PFIC_ISR2_INTENSTA       (0xfffffff << 0) /* 0fffffff: Interrupt ID Status */
#define CH32V103_PFIC_ISR2_INTENSTA_MASK  (0xfffffff << 0)
#define CH32V103_PFIC_IPR1_OFFSET         0x0020
#define CH32V103_PFIC_IPR1                (CH32V103_PFIC_BASE + CH32V103_PFIC_IPR1_OFFSET)
#define CH32V103_PFIC_IPR1_PENDSTA2_3     (0x3 << 2) /* 0000000c: PENDSTA */
#define CH32V103_PFIC_IPR1_PENDSTA2_3_MASK (0x3 << 2)
#define CH32V103_PFIC_IPR1_PENDSTA12_31   (0xfffff << 12) /* fffff000: PENDSTA */
#define CH32V103_PFIC_IPR1_PENDSTA12_31_MASK (0xfffff << 12)
#define CH32V103_PFIC_IPR2_OFFSET         0x0024
#define CH32V103_PFIC_IPR2                (CH32V103_PFIC_BASE + CH32V103_PFIC_IPR2_OFFSET)
#define CH32V103_PFIC_IPR2_PENDSTA        (0xfffffff << 0) /* 0fffffff: PENDSTA */
#define CH32V103_PFIC_IPR2_PENDSTA_MASK   (0xfffffff << 0)
#define CH32V103_PFIC_ITHRESDR_OFFSET     0x0040
#define CH32V103_PFIC_ITHRESDR            (CH32V103_PFIC_BASE + CH32V103_PFIC_ITHRESDR_OFFSET)
#define CH32V103_PFIC_ITHRESDR_THRESHOLD  (0xff << 0) /* 000000ff: THRESHOLD */
#define CH32V103_PFIC_ITHRESDR_THRESHOLD_MASK (0xff << 0)
#define CH32V103_PFIC_FIBADDRR_OFFSET     0x0044
#define CH32V103_PFIC_FIBADDRR            (CH32V103_PFIC_BASE + CH32V103_PFIC_FIBADDRR_OFFSET)
#define CH32V103_PFIC_FIBADDRR_BASEADDR   (0xf << 28) /* f0000000: BASEADDR */
#define CH32V103_PFIC_FIBADDRR_BASEADDR_MASK (0xf << 28)
#define CH32V103_PFIC_CFGR_OFFSET         0x0048
#define CH32V103_PFIC_CFGR                (CH32V103_PFIC_BASE + CH32V103_PFIC_CFGR_OFFSET)
#define CH32V103_PFIC_CFGR_HWSTKCTRL      (1 <<  0) /* 00000001: HWSTKCTRL */
#define CH32V103_PFIC_CFGR_NESTCTRL       (1 <<  1) /* 00000002: NESTCTRL */
#define CH32V103_PFIC_CFGR_NMISET         (1 <<  2) /* 00000004: NMISET */
#define CH32V103_PFIC_CFGR_NMIRESET       (1 <<  3) /* 00000008: NMIRESET */
#define CH32V103_PFIC_CFGR_EXCSET         (1 <<  4) /* 00000010: EXCSET */
#define CH32V103_PFIC_CFGR_EXCRESET       (1 <<  5) /* 00000020: EXCRESET */
#define CH32V103_PFIC_CFGR_PFICRSET       (1 <<  6) /* 00000040: PFICRSET */
#define CH32V103_PFIC_CFGR_SYSRESET       (1 <<  7) /* 00000080: SYSRESET */
#define CH32V103_PFIC_CFGR_KEYCODE        (0xffff << 16) /* ffff0000: KEYCODE */
#define CH32V103_PFIC_CFGR_KEYCODE_MASK   (0xffff << 16)
#define CH32V103_PFIC_GISR_OFFSET         0x004c
#define CH32V103_PFIC_GISR                (CH32V103_PFIC_BASE + CH32V103_PFIC_GISR_OFFSET)
#define CH32V103_PFIC_GISR_NESTSTA        (0xff << 0) /* 000000ff: NESTSTA */
#define CH32V103_PFIC_GISR_NESTSTA_MASK   (0xff << 0)
#define CH32V103_PFIC_GISR_GACTSTA        (1 <<  8) /* 00000100: GACTSTA */
#define CH32V103_PFIC_GISR_GPENDSTA       (1 <<  9) /* 00000200: GPENDSTA */
#define CH32V103_PFIC_FIFOADDRR0_OFFSET   0x0060
#define CH32V103_PFIC_FIFOADDRR0          (CH32V103_PFIC_BASE + CH32V103_PFIC_FIFOADDRR0_OFFSET)
#define CH32V103_PFIC_FIFOADDRR0_OFFADDR0 (0xffffff << 0) /* 00ffffff: OFFADDR0 */
#define CH32V103_PFIC_FIFOADDRR0_OFFADDR0_MASK (0xffffff << 0)
#define CH32V103_PFIC_FIFOADDRR0_IRQID0   (0xff << 24) /* ff000000: IRQID0 */
#define CH32V103_PFIC_FIFOADDRR0_IRQID0_MASK (0xff << 24)
#define CH32V103_PFIC_FIFOADDRR1_OFFSET   0x0064
#define CH32V103_PFIC_FIFOADDRR1          (CH32V103_PFIC_BASE + CH32V103_PFIC_FIFOADDRR1_OFFSET)
#define CH32V103_PFIC_FIFOADDRR1_OFFADDR1 (0xffffff << 0) /* 00ffffff: OFFADDR1 */
#define CH32V103_PFIC_FIFOADDRR1_OFFADDR1_MASK (0xffffff << 0)
#define CH32V103_PFIC_FIFOADDRR1_IRQID1   (0xff << 24) /* ff000000: IRQID1 */
#define CH32V103_PFIC_FIFOADDRR1_IRQID1_MASK (0xff << 24)
#define CH32V103_PFIC_FIFOADDRR2_OFFSET   0x0068
#define CH32V103_PFIC_FIFOADDRR2          (CH32V103_PFIC_BASE + CH32V103_PFIC_FIFOADDRR2_OFFSET)
#define CH32V103_PFIC_FIFOADDRR2_OFFADDR2 (0xffffff << 0) /* 00ffffff: OFFADDR2 */
#define CH32V103_PFIC_FIFOADDRR2_OFFADDR2_MASK (0xffffff << 0)
#define CH32V103_PFIC_FIFOADDRR2_IRQID2   (0xff << 24) /* ff000000: IRQID2 */
#define CH32V103_PFIC_FIFOADDRR2_IRQID2_MASK (0xff << 24)
#define CH32V103_PFIC_FIFOADDRR3_OFFSET   0x006c
#define CH32V103_PFIC_FIFOADDRR3          (CH32V103_PFIC_BASE + CH32V103_PFIC_FIFOADDRR3_OFFSET)
#define CH32V103_PFIC_FIFOADDRR3_OFFADDR3 (0xffffff << 0) /* 00ffffff: OFFADDR3 */
#define CH32V103_PFIC_FIFOADDRR3_OFFADDR3_MASK (0xffffff << 0)
#define CH32V103_PFIC_FIFOADDRR3_IRQID3   (0xff << 24) /* ff000000: IRQID3 */
#define CH32V103_PFIC_FIFOADDRR3_IRQID3_MASK (0xff << 24)
#define CH32V103_PFIC_IENR1_OFFSET        0x0100
#define CH32V103_PFIC_IENR1               (CH32V103_PFIC_BASE + CH32V103_PFIC_IENR1_OFFSET)
#define CH32V103_PFIC_IENR1_INTEN         (0xfffff << 12) /* fffff000: INTEN */
#define CH32V103_PFIC_IENR1_INTEN_MASK    (0xfffff << 12)
#define CH32V103_PFIC_IENR2_OFFSET        0x0104
#define CH32V103_PFIC_IENR2               (CH32V103_PFIC_BASE + CH32V103_PFIC_IENR2_OFFSET)
#define CH32V103_PFIC_IENR2_INTEN         (0xfffffff << 0) /* 0fffffff: INTEN */
#define CH32V103_PFIC_IENR2_INTEN_MASK    (0xfffffff << 0)
#define CH32V103_PFIC_IRER1_OFFSET        0x0180
#define CH32V103_PFIC_IRER1               (CH32V103_PFIC_BASE + CH32V103_PFIC_IRER1_OFFSET)
#define CH32V103_PFIC_IRER1_INTRSET       (0xfffff << 12) /* fffff000: INTRSET */
#define CH32V103_PFIC_IRER1_INTRSET_MASK  (0xfffff << 12)
#define CH32V103_PFIC_IRER2_OFFSET        0x0184
#define CH32V103_PFIC_IRER2               (CH32V103_PFIC_BASE + CH32V103_PFIC_IRER2_OFFSET)
#define CH32V103_PFIC_IRER2_INTRSET       (0xfffffff << 0) /* 0fffffff: INTRSET */
#define CH32V103_PFIC_IRER2_INTRSET_MASK  (0xfffffff << 0)
#define CH32V103_PFIC_IPSR1_OFFSET        0x0200
#define CH32V103_PFIC_IPSR1               (CH32V103_PFIC_BASE + CH32V103_PFIC_IPSR1_OFFSET)
#define CH32V103_PFIC_IPSR1_PENDSET2_3    (0x3 << 2) /* 0000000c: PENDSET */
#define CH32V103_PFIC_IPSR1_PENDSET2_3_MASK (0x3 << 2)
#define CH32V103_PFIC_IPSR1_PENDSET12_31  (0xfffff << 12) /* fffff000: PENDSET */
#define CH32V103_PFIC_IPSR1_PENDSET12_31_MASK (0xfffff << 12)
#define CH32V103_PFIC_IPSR2_OFFSET        0x0204
#define CH32V103_PFIC_IPSR2               (CH32V103_PFIC_BASE + CH32V103_PFIC_IPSR2_OFFSET)
#define CH32V103_PFIC_IPSR2_PENDSET       (0xfffffff << 0) /* 0fffffff: PENDSET */
#define CH32V103_PFIC_IPSR2_PENDSET_MASK  (0xfffffff << 0)
#define CH32V103_PFIC_IPRR1_OFFSET        0x0280
#define CH32V103_PFIC_IPRR1               (CH32V103_PFIC_BASE + CH32V103_PFIC_IPRR1_OFFSET)
#define CH32V103_PFIC_IPRR1_PENDRESET2_3  (0x3 << 2) /* 0000000c: PENDRESET */
#define CH32V103_PFIC_IPRR1_PENDRESET2_3_MASK (0x3 << 2)
#define CH32V103_PFIC_IPRR1_PENDRESET12_31 (0xfffff << 12) /* fffff000: PENDRESET */
#define CH32V103_PFIC_IPRR1_PENDRESET12_31_MASK (0xfffff << 12)
#define CH32V103_PFIC_IPRR2_OFFSET        0x0284
#define CH32V103_PFIC_IPRR2               (CH32V103_PFIC_BASE + CH32V103_PFIC_IPRR2_OFFSET)
#define CH32V103_PFIC_IPRR2_PENDRESET     (0xfffffff << 0) /* 0fffffff: PENDRESET */
#define CH32V103_PFIC_IPRR2_PENDRESET_MASK (0xfffffff << 0)
#define CH32V103_PFIC_IACTR1_OFFSET       0x0300
#define CH32V103_PFIC_IACTR1              (CH32V103_PFIC_BASE + CH32V103_PFIC_IACTR1_OFFSET)
#define CH32V103_PFIC_IACTR1_IACTS        (0xfffff << 12) /* fffff000: IACTS */
#define CH32V103_PFIC_IACTR1_IACTS_MASK   (0xfffff << 12)
#define CH32V103_PFIC_IACTR2_OFFSET       0x0304
#define CH32V103_PFIC_IACTR2              (CH32V103_PFIC_BASE + CH32V103_PFIC_IACTR2_OFFSET)
#define CH32V103_PFIC_IACTR2_IACTS        (0xfffffff << 0) /* 0fffffff: IACTS */
#define CH32V103_PFIC_IACTR2_IACTS_MASK   (0xfffffff << 0)
#define CH32V103_PFIC_SCTLR_OFFSET        0x0d10
#define CH32V103_PFIC_SCTLR               (CH32V103_PFIC_BASE + CH32V103_PFIC_SCTLR_OFFSET)
#define CH32V103_PFIC_SCTLR_SLEEPONEXIT   (1 <<  1) /* 00000002: SLEEPONEXIT */
#define CH32V103_PFIC_SCTLR_SLEEPDEEP     (1 <<  2) /* 00000004: SLEEPDEEP */
#define CH32V103_PFIC_SCTLR_WFITOWFE      (1 <<  3) /* 00000008: WFITOWFE */
#define CH32V103_PFIC_SCTLR_SEVONPEND     (1 <<  4) /* 00000010: SEVONPEND */
#define CH32V103_PFIC_SCTLR_SETEVENT      (1 <<  5) /* 00000020: SETEVENT */
#define CH32V103_PFIC_STK_CTLR_OFFSET     0x1000
#define CH32V103_PFIC_STK_CTLR            (CH32V103_PFIC_BASE + CH32V103_PFIC_STK_CTLR_OFFSET)
#define CH32V103_PFIC_STK_CTLR_STE        (0xfffffff << 0) /* 0fffffff: STE */
#define CH32V103_PFIC_STK_CTLR_STE_MASK   (0xfffffff << 0)

